Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x311 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 8 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x7ae7): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x563e): ../Core/Src/FreeRTOS/heap_2.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x707d): C:/Github/RTOS-Machine-Fault-Diagnosis/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <2b>   DW_AT_name        : (indirect string, offset: 0x55ae): size_t
    <2f>   DW_AT_decl_file   : 2
    <30>   DW_AT_decl_line   : 214
    <31>   DW_AT_decl_column : 23
    <32>   DW_AT_type        : <0x36>
 <1><36>: Abbrev Number: 2 (DW_TAG_base_type)
    <37>   DW_AT_byte_size   : 4
    <38>   DW_AT_encoding    : 7	(unsigned)
    <39>   DW_AT_name        : (indirect string, offset: 0x2b03): unsigned int
 <1><3d>: Abbrev Number: 9 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 5	(signed)
    <40>   DW_AT_name        : int
 <1><44>: Abbrev Number: 2 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 8
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x625a): long long int
 <1><4b>: Abbrev Number: 2 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 8
    <4d>   DW_AT_encoding    : 4	(float)
    <4e>   DW_AT_name        : (indirect string, offset: 0x3d1): long double
 <1><52>: Abbrev Number: 2 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 1
    <54>   DW_AT_encoding    : 6	(signed char)
    <55>   DW_AT_name        : (indirect string, offset: 0x7344): signed char
 <1><59>: Abbrev Number: 3 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x1595): __uint8_t
    <5e>   DW_AT_decl_file   : 3
    <5f>   DW_AT_decl_line   : 43
    <60>   DW_AT_decl_column : 24
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 2 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 1
    <67>   DW_AT_encoding    : 8	(unsigned char)
    <68>   DW_AT_name        : (indirect string, offset: 0x3eb2): unsigned char
 <1><6c>: Abbrev Number: 2 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 2
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0xbbe): short int
 <1><73>: Abbrev Number: 3 (DW_TAG_typedef)
    <74>   DW_AT_name        : (indirect string, offset: 0x3540): __uint16_t
    <78>   DW_AT_decl_file   : 3
    <79>   DW_AT_decl_line   : 57
    <7a>   DW_AT_decl_column : 25
    <7b>   DW_AT_type        : <0x7f>
 <1><7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 2
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x82fc): short unsigned int
 <1><86>: Abbrev Number: 2 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : (indirect string, offset: 0x87c9): long int
 <1><8d>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e>   DW_AT_name        : (indirect string, offset: 0x4efb): __uint32_t
    <92>   DW_AT_decl_file   : 3
    <93>   DW_AT_decl_line   : 79
    <94>   DW_AT_decl_column : 25
    <95>   DW_AT_type        : <0x99>
 <1><99>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x21f2): long unsigned int
 <1><a0>: Abbrev Number: 2 (DW_TAG_base_type)
    <a1>   DW_AT_byte_size   : 8
    <a2>   DW_AT_encoding    : 7	(unsigned)
    <a3>   DW_AT_name        : (indirect string, offset: 0x26fc): long long unsigned int
 <1><a7>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <a8>   DW_AT_byte_size   : 4
 <1><a9>: Abbrev Number: 2 (DW_TAG_base_type)
    <aa>   DW_AT_byte_size   : 1
    <ab>   DW_AT_encoding    : 8	(unsigned char)
    <ac>   DW_AT_name        : (indirect string, offset: 0x692f): char
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x1597): uint8_t
    <b5>   DW_AT_decl_file   : 4
    <b6>   DW_AT_decl_line   : 24
    <b7>   DW_AT_decl_column : 19
    <b8>   DW_AT_type        : <0x59>
 <1><bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x4a9f): uint16_t
    <c1>   DW_AT_decl_file   : 4
    <c2>   DW_AT_decl_line   : 36
    <c3>   DW_AT_decl_column : 20
    <c4>   DW_AT_type        : <0x73>
 <1><c8>: Abbrev Number: 11 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xa274): uint32_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 48
    <d4>   DW_AT_decl_column : 20
    <d5>   DW_AT_type        : <0x8d>
 <1><d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0xb44d): BaseType_t
    <de>   DW_AT_decl_file   : 5
    <df>   DW_AT_decl_line   : 98
    <e0>   DW_AT_decl_column : 14
    <e1>   DW_AT_type        : <0x86>
 <1><e5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <e6>   DW_AT_byte_size   : 4
    <e6>   DW_AT_type        : <0xb0>
 <1><ea>: Abbrev Number: 12 (DW_TAG_array_type)
    <eb>   DW_AT_type        : <0xb0>
    <ef>   DW_AT_sibling     : <0xfb>
 <2><f3>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <f4>   DW_AT_type        : <0x36>
    <f8>   DW_AT_upper_bound : 16383
 <2><fa>: Abbrev Number: 0
 <1><fb>: Abbrev Number: 1 (DW_TAG_variable)
    <fc>   DW_AT_name        : (indirect string, offset: 0x388e): ucHeap
    <100>   DW_AT_decl_file   : 1
    <100>   DW_AT_decl_line   : 67
    <101>   DW_AT_decl_column : 17
    <102>   DW_AT_type        : <0xea>
    <106>   DW_AT_location    : 5 byte block: 3 8 47 0 20 	(DW_OP_addr: 20004708)
 <1><10c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <10d>   DW_AT_name        : (indirect string, offset: 0xa4f3): A_BLOCK_LINK
    <111>   DW_AT_byte_size   : 8
    <112>   DW_AT_decl_file   : 1
    <113>   DW_AT_decl_line   : 73
    <114>   DW_AT_decl_column : 16
    <115>   DW_AT_sibling     : <0x132>
 <2><119>: Abbrev Number: 5 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0x80f8): pxNextFreeBlock
    <11e>   DW_AT_decl_file   : 1
    <11e>   DW_AT_decl_line   : 75
    <11f>   DW_AT_decl_column : 23
    <120>   DW_AT_type        : <0x132>
    <124>   DW_AT_data_member_location: 0
 <2><125>: Abbrev Number: 5 (DW_TAG_member)
    <126>   DW_AT_name        : (indirect string, offset: 0xac57): xBlockSize
    <12a>   DW_AT_decl_file   : 1
    <12a>   DW_AT_decl_line   : 76
    <12b>   DW_AT_decl_column : 9
    <12c>   DW_AT_type        : <0x2a>
    <130>   DW_AT_data_member_location: 4
 <2><131>: Abbrev Number: 0
 <1><132>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <133>   DW_AT_byte_size   : 4
    <133>   DW_AT_type        : <0x10c>
 <1><137>: Abbrev Number: 3 (DW_TAG_typedef)
    <138>   DW_AT_name        : (indirect string, offset: 0x35db): BlockLink_t
    <13c>   DW_AT_decl_file   : 1
    <13d>   DW_AT_decl_line   : 77
    <13e>   DW_AT_decl_column : 3
    <13f>   DW_AT_type        : <0x10c>
 <1><143>: Abbrev Number: 1 (DW_TAG_variable)
    <144>   DW_AT_name        : (indirect string, offset: 0x32dd): heapSTRUCT_SIZE
    <148>   DW_AT_decl_file   : 1
    <148>   DW_AT_decl_line   : 80
    <149>   DW_AT_decl_column : 23
    <14a>   DW_AT_type        : <0xc8>
    <14e>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><154>: Abbrev Number: 1 (DW_TAG_variable)
    <155>   DW_AT_name        : (indirect string, offset: 0xa973): xStart
    <159>   DW_AT_decl_file   : 1
    <159>   DW_AT_decl_line   : 84
    <15a>   DW_AT_decl_column : 20
    <15b>   DW_AT_type        : <0x137>
    <15f>   DW_AT_location    : 5 byte block: 3 8 87 0 20 	(DW_OP_addr: 20008708)
 <1><165>: Abbrev Number: 1 (DW_TAG_variable)
    <166>   DW_AT_name        : (indirect string, offset: 0x68da): xEnd
    <16a>   DW_AT_decl_file   : 1
    <16a>   DW_AT_decl_line   : 84
    <16b>   DW_AT_decl_column : 28
    <16c>   DW_AT_type        : <0x137>
    <170>   DW_AT_location    : 5 byte block: 3 10 87 0 20 	(DW_OP_addr: 20008710)
 <1><176>: Abbrev Number: 1 (DW_TAG_variable)
    <177>   DW_AT_name        : (indirect string, offset: 0x6e95): xFreeBytesRemaining
    <17b>   DW_AT_decl_file   : 1
    <17b>   DW_AT_decl_line   : 88
    <17c>   DW_AT_decl_column : 15
    <17d>   DW_AT_type        : <0x2a>
    <181>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><187>: Abbrev Number: 6 (DW_TAG_subprogram)
    <188>   DW_AT_external    : 1
    <188>   DW_AT_name        : (indirect string, offset: 0x7c9a): vApplicationMallocFailedHook
    <18c>   DW_AT_decl_file   : 1
    <18c>   DW_AT_decl_line   : 200
    <18d>   DW_AT_decl_column : 16
    <18d>   DW_AT_prototyped  : 1
    <18d>   DW_AT_declaration : 1
 <1><18d>: Abbrev Number: 15 (DW_TAG_subprogram)
    <18e>   DW_AT_external    : 1
    <18e>   DW_AT_name        : (indirect string, offset: 0x7062): xTaskResumeAll
    <192>   DW_AT_decl_file   : 6
    <193>   DW_AT_decl_line   : 1341
    <195>   DW_AT_decl_column : 12
    <196>   DW_AT_prototyped  : 1
    <196>   DW_AT_type        : <0xd9>
    <19a>   DW_AT_declaration : 1
 <1><19a>: Abbrev Number: 16 (DW_TAG_subprogram)
    <19b>   DW_AT_external    : 1
    <19b>   DW_AT_name        : (indirect string, offset: 0x4b27): vTaskSuspendAll
    <19f>   DW_AT_decl_file   : 6
    <1a0>   DW_AT_decl_line   : 1287
    <1a2>   DW_AT_decl_column : 6
    <1a3>   DW_AT_prototyped  : 1
    <1a3>   DW_AT_declaration : 1
 <1><1a3>: Abbrev Number: 17 (DW_TAG_subprogram)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x7071): prvHeapInit
    <1a8>   DW_AT_decl_file   : 1
    <1a9>   DW_AT_decl_line   : 249
    <1aa>   DW_AT_decl_column : 13
    <1ab>   DW_AT_prototyped  : 1
    <1ab>   DW_AT_low_pc      : 0x80011c8
    <1af>   DW_AT_high_pc     : 0x54
    <1b3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1b5>   DW_AT_call_all_calls: 1
    <1b5>   DW_AT_sibling     : <0x1d6>
 <2><1b9>: Abbrev Number: 1 (DW_TAG_variable)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x29fd): pxFirstFreeBlock
    <1be>   DW_AT_decl_file   : 1
    <1be>   DW_AT_decl_line   : 251
    <1bf>   DW_AT_decl_column : 14
    <1c0>   DW_AT_type        : <0x1d6>
    <1c4>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><1c7>: Abbrev Number: 1 (DW_TAG_variable)
    <1c8>   DW_AT_name        : (indirect string, offset: 0x2d69): pucAlignedHeap
    <1cc>   DW_AT_decl_file   : 1
    <1cc>   DW_AT_decl_line   : 252
    <1cd>   DW_AT_decl_column : 10
    <1ce>   DW_AT_type        : <0xe5>
    <1d2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1d5>: Abbrev Number: 0
 <1><1d6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <1d7>   DW_AT_byte_size   : 4
    <1d7>   DW_AT_type        : <0x137>
 <1><1db>: Abbrev Number: 18 (DW_TAG_subprogram)
    <1dc>   DW_AT_external    : 1
    <1dc>   DW_AT_name        : (indirect string, offset: 0x393): vPortInitialiseBlocks
    <1e0>   DW_AT_decl_file   : 1
    <1e1>   DW_AT_decl_line   : 243
    <1e2>   DW_AT_decl_column : 6
    <1e3>   DW_AT_prototyped  : 1
    <1e3>   DW_AT_low_pc      : 0
    <1e7>   DW_AT_high_pc     : 0xe
    <1eb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1ed>   DW_AT_call_all_calls: 1
 <1><1ed>: Abbrev Number: 19 (DW_TAG_subprogram)
    <1ee>   DW_AT_external    : 1
    <1ee>   DW_AT_name        : (indirect string, offset: 0x91a): xPortGetFreeHeapSize
    <1f2>   DW_AT_decl_file   : 1
    <1f3>   DW_AT_decl_line   : 237
    <1f4>   DW_AT_decl_column : 8
    <1f5>   DW_AT_prototyped  : 1
    <1f5>   DW_AT_type        : <0x2a>
    <1f9>   DW_AT_low_pc      : 0
    <1fd>   DW_AT_high_pc     : 0x18
    <201>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <203>   DW_AT_call_all_calls: 1
 <1><203>: Abbrev Number: 20 (DW_TAG_subprogram)
    <204>   DW_AT_external    : 1
    <204>   DW_AT_name        : (indirect string, offset: 0xab85): vPortFree
    <208>   DW_AT_decl_file   : 1
    <209>   DW_AT_decl_line   : 210
    <20a>   DW_AT_decl_column : 6
    <20b>   DW_AT_prototyped  : 1
    <20b>   DW_AT_low_pc      : 0x8001154
    <20f>   DW_AT_high_pc     : 0x74
    <213>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <215>   DW_AT_call_all_tail_calls: 1
    <215>   DW_AT_sibling     : <0x26b>
 <2><219>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <21a>   DW_AT_name        : pv
    <21d>   DW_AT_decl_file   : 1
    <21e>   DW_AT_decl_line   : 210
    <21f>   DW_AT_decl_column : 23
    <220>   DW_AT_type        : <0xa7>
    <224>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><227>: Abbrev Number: 22 (DW_TAG_variable)
    <228>   DW_AT_name        : puc
    <22c>   DW_AT_decl_file   : 1
    <22d>   DW_AT_decl_line   : 212
    <22e>   DW_AT_decl_column : 10
    <22f>   DW_AT_type        : <0xe5>
    <233>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><236>: Abbrev Number: 1 (DW_TAG_variable)
    <237>   DW_AT_name        : (indirect string, offset: 0x6a71): pxLink
    <23b>   DW_AT_decl_file   : 1
    <23b>   DW_AT_decl_line   : 213
    <23c>   DW_AT_decl_column : 14
    <23d>   DW_AT_type        : <0x1d6>
    <241>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><244>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <245>   DW_AT_low_pc      : 0x8001178
    <249>   DW_AT_high_pc     : 0x2c
 <3><24d>: Abbrev Number: 1 (DW_TAG_variable)
    <24e>   DW_AT_name        : (indirect string, offset: 0x4ff4): pxIterator
    <252>   DW_AT_decl_file   : 1
    <252>   DW_AT_decl_line   : 228
    <253>   DW_AT_decl_column : 4
    <254>   DW_AT_type        : <0x1d6>
    <258>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><25b>: Abbrev Number: 1 (DW_TAG_variable)
    <25c>   DW_AT_name        : (indirect string, offset: 0xac57): xBlockSize
    <260>   DW_AT_decl_file   : 1
    <260>   DW_AT_decl_line   : 228
    <261>   DW_AT_decl_column : 4
    <262>   DW_AT_type        : <0x2a>
    <266>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><269>: Abbrev Number: 0
 <2><26a>: Abbrev Number: 0
 <1><26b>: Abbrev Number: 23 (DW_TAG_subprogram)
    <26c>   DW_AT_external    : 1
    <26c>   DW_AT_name        : (indirect string, offset: 0x2689): pvPortMalloc
    <270>   DW_AT_decl_file   : 1
    <271>   DW_AT_decl_line   : 118
    <272>   DW_AT_decl_column : 7
    <273>   DW_AT_prototyped  : 1
    <273>   DW_AT_type        : <0xa7>
    <277>   DW_AT_low_pc      : 0x8001030
    <27b>   DW_AT_high_pc     : 0x124
    <27f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <281>   DW_AT_call_all_tail_calls: 1
 <2><281>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <282>   DW_AT_name        : (indirect string, offset: 0x4b1b): xWantedSize
    <286>   DW_AT_decl_file   : 1
    <287>   DW_AT_decl_line   : 118
    <288>   DW_AT_decl_column : 28
    <289>   DW_AT_type        : <0x2a>
    <28d>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><290>: Abbrev Number: 1 (DW_TAG_variable)
    <291>   DW_AT_name        : (indirect string, offset: 0x5a65): pxBlock
    <295>   DW_AT_decl_file   : 1
    <295>   DW_AT_decl_line   : 120
    <296>   DW_AT_decl_column : 14
    <297>   DW_AT_type        : <0x1d6>
    <29b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><29e>: Abbrev Number: 1 (DW_TAG_variable)
    <29f>   DW_AT_name        : (indirect string, offset: 0x7930): pxPreviousBlock
    <2a3>   DW_AT_decl_file   : 1
    <2a3>   DW_AT_decl_line   : 120
    <2a4>   DW_AT_decl_column : 24
    <2a5>   DW_AT_type        : <0x1d6>
    <2a9>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><2ac>: Abbrev Number: 1 (DW_TAG_variable)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x4f49): pxNewBlockLink
    <2b1>   DW_AT_decl_file   : 1
    <2b1>   DW_AT_decl_line   : 120
    <2b2>   DW_AT_decl_column : 42
    <2b3>   DW_AT_type        : <0x1d6>
    <2b7>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><2ba>: Abbrev Number: 1 (DW_TAG_variable)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x95fb): xHeapHasBeenInitialised
    <2bf>   DW_AT_decl_file   : 1
    <2bf>   DW_AT_decl_line   : 121
    <2c0>   DW_AT_decl_column : 19
    <2c1>   DW_AT_type        : <0xd9>
    <2c5>   DW_AT_location    : 5 byte block: 3 18 87 0 20 	(DW_OP_addr: 20008718)
 <2><2cb>: Abbrev Number: 1 (DW_TAG_variable)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x65dc): pvReturn
    <2d0>   DW_AT_decl_file   : 1
    <2d0>   DW_AT_decl_line   : 122
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0xa7>
    <2d6>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><2d9>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <2da>   DW_AT_low_pc      : 0x80010f2
    <2de>   DW_AT_high_pc     : 0x2c
    <2e2>   DW_AT_sibling     : <0x303>
 <3><2e6>: Abbrev Number: 1 (DW_TAG_variable)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x4ff4): pxIterator
    <2eb>   DW_AT_decl_file   : 1
    <2eb>   DW_AT_decl_line   : 185
    <2ec>   DW_AT_decl_column : 6
    <2ed>   DW_AT_type        : <0x1d6>
    <2f1>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><2f4>: Abbrev Number: 1 (DW_TAG_variable)
    <2f5>   DW_AT_name        : (indirect string, offset: 0xac57): xBlockSize
    <2f9>   DW_AT_decl_file   : 1
    <2f9>   DW_AT_decl_line   : 185
    <2fa>   DW_AT_decl_column : 6
    <2fb>   DW_AT_type        : <0x2a>
    <2ff>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><302>: Abbrev Number: 0
 <2><303>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <304>   DW_AT_low_pc      : 0x8001136
    <308>   DW_AT_high_pc     : 0x4
 <3><30c>: Abbrev Number: 6 (DW_TAG_subprogram)
    <30d>   DW_AT_external    : 1
    <30d>   DW_AT_name        : (indirect string, offset: 0x7c9a): vApplicationMallocFailedHook
    <311>   DW_AT_decl_file   : 1
    <311>   DW_AT_decl_line   : 200
    <312>   DW_AT_decl_column : 16
    <312>   DW_AT_prototyped  : 1
    <312>   DW_AT_declaration : 1
 <3><312>: Abbrev Number: 0
 <2><313>: Abbrev Number: 0
 <1><314>: Abbrev Number: 0
  Compilation Unit @ offset 0x315:
   Length:        0x2ab (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1a1
   Pointer Size:  4
 <0><321>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <322>   DW_AT_producer    : (indirect string, offset: 0x7ae7): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <326>   DW_AT_language    : 29	(C11)
    <327>   DW_AT_name        : (indirect string, offset: 0xb3ef): ../Core/Src/FreeRTOS/list.c
    <32b>   DW_AT_comp_dir    : (indirect string, offset: 0x707d): C:/Github/RTOS-Machine-Fault-Diagnosis/Debug
    <32f>   DW_AT_ranges      : 0x38
    <333>   DW_AT_low_pc      : 0
    <337>   DW_AT_stmt_list   : 0x7d0
    <33b>   DW_AT_macros      : 0x1c4
 <1><33f>: Abbrev Number: 1 (DW_TAG_base_type)
    <340>   DW_AT_byte_size   : 4
    <341>   DW_AT_encoding    : 7	(unsigned)
    <342>   DW_AT_name        : (indirect string, offset: 0x2b03): unsigned int
 <1><346>: Abbrev Number: 11 (DW_TAG_base_type)
    <347>   DW_AT_byte_size   : 4
    <348>   DW_AT_encoding    : 5	(signed)
    <349>   DW_AT_name        : int
 <1><34d>: Abbrev Number: 1 (DW_TAG_base_type)
    <34e>   DW_AT_byte_size   : 8
    <34f>   DW_AT_encoding    : 5	(signed)
    <350>   DW_AT_name        : (indirect string, offset: 0x625a): long long int
 <1><354>: Abbrev Number: 1 (DW_TAG_base_type)
    <355>   DW_AT_byte_size   : 8
    <356>   DW_AT_encoding    : 4	(float)
    <357>   DW_AT_name        : (indirect string, offset: 0x3d1): long double
 <1><35b>: Abbrev Number: 1 (DW_TAG_base_type)
    <35c>   DW_AT_byte_size   : 1
    <35d>   DW_AT_encoding    : 6	(signed char)
    <35e>   DW_AT_name        : (indirect string, offset: 0x7344): signed char
 <1><362>: Abbrev Number: 1 (DW_TAG_base_type)
    <363>   DW_AT_byte_size   : 1
    <364>   DW_AT_encoding    : 8	(unsigned char)
    <365>   DW_AT_name        : (indirect string, offset: 0x3eb2): unsigned char
 <1><369>: Abbrev Number: 1 (DW_TAG_base_type)
    <36a>   DW_AT_byte_size   : 2
    <36b>   DW_AT_encoding    : 5	(signed)
    <36c>   DW_AT_name        : (indirect string, offset: 0xbbe): short int
 <1><370>: Abbrev Number: 1 (DW_TAG_base_type)
    <371>   DW_AT_byte_size   : 2
    <372>   DW_AT_encoding    : 7	(unsigned)
    <373>   DW_AT_name        : (indirect string, offset: 0x82fc): short unsigned int
 <1><377>: Abbrev Number: 1 (DW_TAG_base_type)
    <378>   DW_AT_byte_size   : 4
    <379>   DW_AT_encoding    : 5	(signed)
    <37a>   DW_AT_name        : (indirect string, offset: 0x87c9): long int
 <1><37e>: Abbrev Number: 3 (DW_TAG_typedef)
    <37f>   DW_AT_name        : (indirect string, offset: 0x4efb): __uint32_t
    <383>   DW_AT_decl_file   : 2
    <384>   DW_AT_decl_line   : 79
    <385>   DW_AT_decl_column : 25
    <386>   DW_AT_type        : <0x38a>
 <1><38a>: Abbrev Number: 1 (DW_TAG_base_type)
    <38b>   DW_AT_byte_size   : 4
    <38c>   DW_AT_encoding    : 7	(unsigned)
    <38d>   DW_AT_name        : (indirect string, offset: 0x21f2): long unsigned int
 <1><391>: Abbrev Number: 1 (DW_TAG_base_type)
    <392>   DW_AT_byte_size   : 8
    <393>   DW_AT_encoding    : 7	(unsigned)
    <394>   DW_AT_name        : (indirect string, offset: 0x26fc): long long unsigned int
 <1><398>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <399>   DW_AT_byte_size   : 4
 <1><39a>: Abbrev Number: 1 (DW_TAG_base_type)
    <39b>   DW_AT_byte_size   : 1
    <39c>   DW_AT_encoding    : 8	(unsigned char)
    <39d>   DW_AT_name        : (indirect string, offset: 0x692f): char
 <1><3a1>: Abbrev Number: 3 (DW_TAG_typedef)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xa274): uint32_t
    <3a6>   DW_AT_decl_file   : 3
    <3a7>   DW_AT_decl_line   : 48
    <3a8>   DW_AT_decl_column : 20
    <3a9>   DW_AT_type        : <0x37e>
 <1><3ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <3ae>   DW_AT_name        : (indirect string, offset: 0xb44c): UBaseType_t
    <3b2>   DW_AT_decl_file   : 4
    <3b3>   DW_AT_decl_line   : 99
    <3b4>   DW_AT_decl_column : 23
    <3b5>   DW_AT_type        : <0x38a>
 <1><3b9>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <3ba>   DW_AT_type        : <0x3ad>
 <1><3be>: Abbrev Number: 3 (DW_TAG_typedef)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x9a7c): TickType_t
    <3c3>   DW_AT_decl_file   : 4
    <3c4>   DW_AT_decl_line   : 105
    <3c5>   DW_AT_decl_column : 19
    <3c6>   DW_AT_type        : <0x3a1>
 <1><3ca>: Abbrev Number: 7 (DW_TAG_const_type)
    <3cb>   DW_AT_type        : <0x3be>
 <1><3cf>: Abbrev Number: 8 (DW_TAG_structure_type)
    <3d0>   DW_AT_name        : (indirect string, offset: 0xb3e4): xLIST_ITEM
    <3d4>   DW_AT_byte_size   : 20
    <3d5>   DW_AT_decl_file   : 5
    <3d5>   DW_AT_decl_line   : 140
    <3d6>   DW_AT_decl_column : 8
    <3d7>   DW_AT_sibling     : <0x418>
 <2><3db>: Abbrev Number: 2 (DW_TAG_member)
    <3dc>   DW_AT_name        : (indirect string, offset: 0xb48c): xItemValue
    <3e0>   DW_AT_decl_file   : 5
    <3e0>   DW_AT_decl_line   : 143
    <3e1>   DW_AT_decl_column : 33
    <3e2>   DW_AT_type        : <0x3be>
    <3e6>   DW_AT_data_member_location: 0
 <2><3e7>: Abbrev Number: 2 (DW_TAG_member)
    <3e8>   DW_AT_name        : (indirect string, offset: 0xb37f): pxNext
    <3ec>   DW_AT_decl_file   : 5
    <3ec>   DW_AT_decl_line   : 144
    <3ed>   DW_AT_decl_column : 42
    <3ee>   DW_AT_type        : <0x418>
    <3f2>   DW_AT_data_member_location: 4
 <2><3f3>: Abbrev Number: 2 (DW_TAG_member)
    <3f4>   DW_AT_name        : (indirect string, offset: 0xb458): pxPrevious
    <3f8>   DW_AT_decl_file   : 5
    <3f8>   DW_AT_decl_line   : 145
    <3f9>   DW_AT_decl_column : 42
    <3fa>   DW_AT_type        : <0x418>
    <3fe>   DW_AT_data_member_location: 8
 <2><3ff>: Abbrev Number: 2 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0xb438): pvOwner
    <404>   DW_AT_decl_file   : 5
    <404>   DW_AT_decl_line   : 146
    <405>   DW_AT_decl_column : 9
    <406>   DW_AT_type        : <0x398>
    <40a>   DW_AT_data_member_location: 12
 <2><40b>: Abbrev Number: 2 (DW_TAG_member)
    <40c>   DW_AT_name        : (indirect string, offset: 0x1a4c): pvContainer
    <410>   DW_AT_decl_file   : 5
    <410>   DW_AT_decl_line   : 147
    <411>   DW_AT_decl_column : 37
    <412>   DW_AT_type        : <0x44e>
    <416>   DW_AT_data_member_location: 16
 <2><417>: Abbrev Number: 0
 <1><418>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <419>   DW_AT_byte_size   : 4
    <419>   DW_AT_type        : <0x3cf>
 <1><41d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <41e>   DW_AT_name        : (indirect string, offset: 0xb486): xLIST
    <422>   DW_AT_byte_size   : 20
    <423>   DW_AT_decl_file   : 5
    <423>   DW_AT_decl_line   : 164
    <424>   DW_AT_decl_column : 16
    <425>   DW_AT_sibling     : <0x44e>
 <2><429>: Abbrev Number: 2 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0xb40b): uxNumberOfItems
    <42e>   DW_AT_decl_file   : 5
    <42e>   DW_AT_decl_line   : 167
    <42f>   DW_AT_decl_column : 23
    <430>   DW_AT_type        : <0x3b9>
    <434>   DW_AT_data_member_location: 0
 <2><435>: Abbrev Number: 2 (DW_TAG_member)
    <436>   DW_AT_name        : (indirect string, offset: 0xb3ac): pxIndex
    <43a>   DW_AT_decl_file   : 5
    <43a>   DW_AT_decl_line   : 168
    <43b>   DW_AT_decl_column : 35
    <43c>   DW_AT_type        : <0x49c>
    <440>   DW_AT_data_member_location: 4
 <2><441>: Abbrev Number: 2 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0xb41b): xListEnd
    <446>   DW_AT_decl_file   : 5
    <446>   DW_AT_decl_line   : 169
    <447>   DW_AT_decl_column : 17
    <448>   DW_AT_type        : <0x490>
    <44c>   DW_AT_data_member_location: 8
 <2><44d>: Abbrev Number: 0
 <1><44e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <44f>   DW_AT_byte_size   : 4
    <44f>   DW_AT_type        : <0x41d>
 <1><453>: Abbrev Number: 3 (DW_TAG_typedef)
    <454>   DW_AT_name        : (indirect string, offset: 0x2e6c): ListItem_t
    <458>   DW_AT_decl_file   : 5
    <459>   DW_AT_decl_line   : 150
    <45a>   DW_AT_decl_column : 27
    <45b>   DW_AT_type        : <0x3cf>
 <1><45f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <460>   DW_AT_name        : (indirect string, offset: 0xb3b4): xMINI_LIST_ITEM
    <464>   DW_AT_byte_size   : 12
    <465>   DW_AT_decl_file   : 5
    <465>   DW_AT_decl_line   : 152
    <466>   DW_AT_decl_column : 8
    <467>   DW_AT_sibling     : <0x490>
 <2><46b>: Abbrev Number: 2 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0xb48c): xItemValue
    <470>   DW_AT_decl_file   : 5
    <470>   DW_AT_decl_line   : 155
    <471>   DW_AT_decl_column : 33
    <472>   DW_AT_type        : <0x3be>
    <476>   DW_AT_data_member_location: 0
 <2><477>: Abbrev Number: 2 (DW_TAG_member)
    <478>   DW_AT_name        : (indirect string, offset: 0xb37f): pxNext
    <47c>   DW_AT_decl_file   : 5
    <47c>   DW_AT_decl_line   : 156
    <47d>   DW_AT_decl_column : 42
    <47e>   DW_AT_type        : <0x418>
    <482>   DW_AT_data_member_location: 4
 <2><483>: Abbrev Number: 2 (DW_TAG_member)
    <484>   DW_AT_name        : (indirect string, offset: 0xb458): pxPrevious
    <488>   DW_AT_decl_file   : 5
    <488>   DW_AT_decl_line   : 157
    <489>   DW_AT_decl_column : 42
    <48a>   DW_AT_type        : <0x418>
    <48e>   DW_AT_data_member_location: 8
 <2><48f>: Abbrev Number: 0
 <1><490>: Abbrev Number: 3 (DW_TAG_typedef)
    <491>   DW_AT_name        : (indirect string, offset: 0xc95e): MiniListItem_t
    <495>   DW_AT_decl_file   : 5
    <496>   DW_AT_decl_line   : 159
    <497>   DW_AT_decl_column : 32
    <498>   DW_AT_type        : <0x45f>
 <1><49c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <49d>   DW_AT_byte_size   : 4
    <49d>   DW_AT_type        : <0x453>
 <1><4a1>: Abbrev Number: 7 (DW_TAG_const_type)
    <4a2>   DW_AT_type        : <0x49c>
 <1><4a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <4a7>   DW_AT_name        : (indirect string, offset: 0x1aea): List_t
    <4ab>   DW_AT_decl_file   : 5
    <4ac>   DW_AT_decl_line   : 171
    <4ad>   DW_AT_decl_column : 3
    <4ae>   DW_AT_type        : <0x41d>
 <1><4b2>: Abbrev Number: 14 (DW_TAG_subprogram)
    <4b3>   DW_AT_external    : 1
    <4b3>   DW_AT_name        : (indirect string, offset: 0xb479): uxListRemove
    <4b7>   DW_AT_decl_file   : 1
    <4b8>   DW_AT_decl_line   : 170
    <4b9>   DW_AT_decl_column : 13
    <4ba>   DW_AT_prototyped  : 1
    <4ba>   DW_AT_type        : <0x3ad>
    <4be>   DW_AT_low_pc      : 0x8001330
    <4c2>   DW_AT_high_pc     : 0x54
    <4c6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4c8>   DW_AT_call_all_calls: 1
    <4c8>   DW_AT_sibling     : <0x4e9>
 <2><4cc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <4cd>   DW_AT_name        : (indirect string, offset: 0xb463): pxItemToRemove
    <4d1>   DW_AT_decl_file   : 1
    <4d1>   DW_AT_decl_line   : 170
    <4d2>   DW_AT_decl_column : 46
    <4d3>   DW_AT_type        : <0x4a1>
    <4d7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><4da>: Abbrev Number: 6 (DW_TAG_variable)
    <4db>   DW_AT_name        : (indirect string, offset: 0xb472): pxList
    <4df>   DW_AT_decl_file   : 1
    <4df>   DW_AT_decl_line   : 174
    <4e0>   DW_AT_decl_column : 16
    <4e1>   DW_AT_type        : <0x4ee>
    <4e5>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><4e8>: Abbrev Number: 0
 <1><4e9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <4ea>   DW_AT_byte_size   : 4
    <4ea>   DW_AT_type        : <0x4a6>
 <1><4ee>: Abbrev Number: 7 (DW_TAG_const_type)
    <4ef>   DW_AT_type        : <0x4e9>
 <1><4f3>: Abbrev Number: 9 (DW_TAG_subprogram)
    <4f4>   DW_AT_external    : 1
    <4f4>   DW_AT_name        : (indirect string, offset: 0xb440): vListInsert
    <4f8>   DW_AT_decl_file   : 1
    <4f8>   DW_AT_decl_line   : 103
    <4f9>   DW_AT_decl_column : 6
    <4f9>   DW_AT_prototyped  : 1
    <4f9>   DW_AT_low_pc      : 0x80012be
    <4fd>   DW_AT_high_pc     : 0x72
    <501>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <503>   DW_AT_call_all_calls: 1
    <503>   DW_AT_sibling     : <0x540>
 <2><507>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <508>   DW_AT_name        : (indirect string, offset: 0xb472): pxList
    <50c>   DW_AT_decl_file   : 1
    <50c>   DW_AT_decl_line   : 103
    <50d>   DW_AT_decl_column : 34
    <50e>   DW_AT_type        : <0x4ee>
    <512>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><515>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <516>   DW_AT_name        : (indirect string, offset: 0xb3c4): pxNewListItem
    <51a>   DW_AT_decl_file   : 1
    <51a>   DW_AT_decl_line   : 103
    <51b>   DW_AT_decl_column : 61
    <51c>   DW_AT_type        : <0x4a1>
    <520>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><523>: Abbrev Number: 6 (DW_TAG_variable)
    <524>   DW_AT_name        : (indirect string, offset: 0x4ff4): pxIterator
    <528>   DW_AT_decl_file   : 1
    <528>   DW_AT_decl_line   : 105
    <529>   DW_AT_decl_column : 13
    <52a>   DW_AT_type        : <0x49c>
    <52e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><531>: Abbrev Number: 6 (DW_TAG_variable)
    <532>   DW_AT_name        : (indirect string, offset: 0xb3d2): xValueOfInsertion
    <536>   DW_AT_decl_file   : 1
    <536>   DW_AT_decl_line   : 106
    <537>   DW_AT_decl_column : 18
    <538>   DW_AT_type        : <0x3ca>
    <53c>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><53f>: Abbrev Number: 0
 <1><540>: Abbrev Number: 9 (DW_TAG_subprogram)
    <541>   DW_AT_external    : 1
    <541>   DW_AT_name        : (indirect string, offset: 0xb39d): vListInsertEnd
    <545>   DW_AT_decl_file   : 1
    <545>   DW_AT_decl_line   : 74
    <546>   DW_AT_decl_column : 6
    <546>   DW_AT_prototyped  : 1
    <546>   DW_AT_low_pc      : 0x8001276
    <54a>   DW_AT_high_pc     : 0x48
    <54e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <550>   DW_AT_call_all_calls: 1
    <550>   DW_AT_sibling     : <0x57f>
 <2><554>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <555>   DW_AT_name        : (indirect string, offset: 0xb472): pxList
    <559>   DW_AT_decl_file   : 1
    <559>   DW_AT_decl_line   : 74
    <55a>   DW_AT_decl_column : 37
    <55b>   DW_AT_type        : <0x4ee>
    <55f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><562>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <563>   DW_AT_name        : (indirect string, offset: 0xb3c4): pxNewListItem
    <567>   DW_AT_decl_file   : 1
    <567>   DW_AT_decl_line   : 74
    <568>   DW_AT_decl_column : 64
    <569>   DW_AT_type        : <0x4a1>
    <56d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><570>: Abbrev Number: 6 (DW_TAG_variable)
    <571>   DW_AT_name        : (indirect string, offset: 0xb3ac): pxIndex
    <575>   DW_AT_decl_file   : 1
    <575>   DW_AT_decl_line   : 76
    <576>   DW_AT_decl_column : 20
    <577>   DW_AT_type        : <0x4a1>
    <57b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><57e>: Abbrev Number: 0
 <1><57f>: Abbrev Number: 9 (DW_TAG_subprogram)
    <580>   DW_AT_external    : 1
    <580>   DW_AT_name        : (indirect string, offset: 0xb424): vListInitialiseItem
    <584>   DW_AT_decl_file   : 1
    <584>   DW_AT_decl_line   : 62
    <585>   DW_AT_decl_column : 6
    <585>   DW_AT_prototyped  : 1
    <585>   DW_AT_low_pc      : 0x800125c
    <589>   DW_AT_high_pc     : 0x1a
    <58d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <58f>   DW_AT_call_all_calls: 1
    <58f>   DW_AT_sibling     : <0x5a2>
 <2><593>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <594>   DW_AT_name        : (indirect string, offset: 0xb386): pxItem
    <598>   DW_AT_decl_file   : 1
    <598>   DW_AT_decl_line   : 62
    <599>   DW_AT_decl_column : 46
    <59a>   DW_AT_type        : <0x4a1>
    <59e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5a1>: Abbrev Number: 0
 <1><5a2>: Abbrev Number: 15 (DW_TAG_subprogram)
    <5a3>   DW_AT_external    : 1
    <5a3>   DW_AT_name        : (indirect string, offset: 0xb38d): vListInitialise
    <5a7>   DW_AT_decl_file   : 1
    <5a8>   DW_AT_decl_line   : 37
    <5a9>   DW_AT_decl_column : 6
    <5aa>   DW_AT_prototyped  : 1
    <5aa>   DW_AT_low_pc      : 0x800121c
    <5ae>   DW_AT_high_pc     : 0x40
    <5b2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5b4>   DW_AT_call_all_calls: 1
 <2><5b4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <5b5>   DW_AT_name        : (indirect string, offset: 0xb472): pxList
    <5b9>   DW_AT_decl_file   : 1
    <5b9>   DW_AT_decl_line   : 37
    <5ba>   DW_AT_decl_column : 38
    <5bb>   DW_AT_type        : <0x4ee>
    <5bf>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 0
  Compilation Unit @ offset 0x5c4:
   Length:        0x4ad (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x296
   Pointer Size:  4
 <0><5d0>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <5d1>   DW_AT_producer    : (indirect string, offset: 0x7ae7): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <5d5>   DW_AT_language    : 29	(C11)
    <5d6>   DW_AT_name        : (indirect string, offset: 0xb669): ../Core/Src/FreeRTOS/port.c
    <5da>   DW_AT_comp_dir    : (indirect string, offset: 0x707d): C:/Github/RTOS-Machine-Fault-Diagnosis/Debug
    <5de>   DW_AT_ranges      : 0x63
    <5e2>   DW_AT_low_pc      : 0
    <5e6>   DW_AT_stmt_list   : 0xf53
    <5ea>   DW_AT_macros      : 0x35b
 <1><5ee>: Abbrev Number: 17 (DW_TAG_base_type)
    <5ef>   DW_AT_byte_size   : 4
    <5f0>   DW_AT_encoding    : 5	(signed)
    <5f1>   DW_AT_name        : int
 <1><5f5>: Abbrev Number: 1 (DW_TAG_base_type)
    <5f6>   DW_AT_byte_size   : 4
    <5f7>   DW_AT_encoding    : 7	(unsigned)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x2b03): unsigned int
 <1><5fc>: Abbrev Number: 1 (DW_TAG_base_type)
    <5fd>   DW_AT_byte_size   : 8
    <5fe>   DW_AT_encoding    : 5	(signed)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x625a): long long int
 <1><603>: Abbrev Number: 1 (DW_TAG_base_type)
    <604>   DW_AT_byte_size   : 8
    <605>   DW_AT_encoding    : 4	(float)
    <606>   DW_AT_name        : (indirect string, offset: 0x3d1): long double
 <1><60a>: Abbrev Number: 1 (DW_TAG_base_type)
    <60b>   DW_AT_byte_size   : 1
    <60c>   DW_AT_encoding    : 6	(signed char)
    <60d>   DW_AT_name        : (indirect string, offset: 0x7344): signed char
 <1><611>: Abbrev Number: 3 (DW_TAG_typedef)
    <612>   DW_AT_name        : (indirect string, offset: 0x1595): __uint8_t
    <616>   DW_AT_decl_file   : 3
    <617>   DW_AT_decl_line   : 43
    <618>   DW_AT_decl_column : 24
    <619>   DW_AT_type        : <0x61d>
 <1><61d>: Abbrev Number: 1 (DW_TAG_base_type)
    <61e>   DW_AT_byte_size   : 1
    <61f>   DW_AT_encoding    : 8	(unsigned char)
    <620>   DW_AT_name        : (indirect string, offset: 0x3eb2): unsigned char
 <1><624>: Abbrev Number: 1 (DW_TAG_base_type)
    <625>   DW_AT_byte_size   : 2
    <626>   DW_AT_encoding    : 5	(signed)
    <627>   DW_AT_name        : (indirect string, offset: 0xbbe): short int
 <1><62b>: Abbrev Number: 1 (DW_TAG_base_type)
    <62c>   DW_AT_byte_size   : 2
    <62d>   DW_AT_encoding    : 7	(unsigned)
    <62e>   DW_AT_name        : (indirect string, offset: 0x82fc): short unsigned int
 <1><632>: Abbrev Number: 1 (DW_TAG_base_type)
    <633>   DW_AT_byte_size   : 4
    <634>   DW_AT_encoding    : 5	(signed)
    <635>   DW_AT_name        : (indirect string, offset: 0x87c9): long int
 <1><639>: Abbrev Number: 3 (DW_TAG_typedef)
    <63a>   DW_AT_name        : (indirect string, offset: 0x4efb): __uint32_t
    <63e>   DW_AT_decl_file   : 3
    <63f>   DW_AT_decl_line   : 79
    <640>   DW_AT_decl_column : 25
    <641>   DW_AT_type        : <0x645>
 <1><645>: Abbrev Number: 1 (DW_TAG_base_type)
    <646>   DW_AT_byte_size   : 4
    <647>   DW_AT_encoding    : 7	(unsigned)
    <648>   DW_AT_name        : (indirect string, offset: 0x21f2): long unsigned int
 <1><64c>: Abbrev Number: 1 (DW_TAG_base_type)
    <64d>   DW_AT_byte_size   : 8
    <64e>   DW_AT_encoding    : 7	(unsigned)
    <64f>   DW_AT_name        : (indirect string, offset: 0x26fc): long long unsigned int
 <1><653>: Abbrev Number: 3 (DW_TAG_typedef)
    <654>   DW_AT_name        : (indirect string, offset: 0x1597): uint8_t
    <658>   DW_AT_decl_file   : 4
    <659>   DW_AT_decl_line   : 24
    <65a>   DW_AT_decl_column : 19
    <65b>   DW_AT_type        : <0x611>
 <1><65f>: Abbrev Number: 10 (DW_TAG_const_type)
    <660>   DW_AT_type        : <0x653>
 <1><664>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <665>   DW_AT_type        : <0x65f>
 <1><669>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <66a>   DW_AT_type        : <0x653>
 <1><66e>: Abbrev Number: 3 (DW_TAG_typedef)
    <66f>   DW_AT_name        : (indirect string, offset: 0xa274): uint32_t
    <673>   DW_AT_decl_file   : 4
    <674>   DW_AT_decl_line   : 48
    <675>   DW_AT_decl_column : 20
    <676>   DW_AT_type        : <0x639>
 <1><67a>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <67b>   DW_AT_type        : <0x66e>
 <1><67f>: Abbrev Number: 18 (DW_TAG_variable)
    <680>   DW_AT_name        : (indirect string, offset: 0xb807): SystemCoreClock
    <684>   DW_AT_decl_file   : 6
    <685>   DW_AT_decl_line   : 76
    <686>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0x66e>
    <68b>   DW_AT_external    : 1
    <68b>   DW_AT_declaration : 1
 <1><68b>: Abbrev Number: 3 (DW_TAG_typedef)
    <68c>   DW_AT_name        : (indirect string, offset: 0x8d17): TaskFunction_t
    <690>   DW_AT_decl_file   : 5
    <691>   DW_AT_decl_line   : 35
    <692>   DW_AT_decl_column : 16
    <693>   DW_AT_type        : <0x697>
 <1><697>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <698>   DW_AT_byte_size   : 4
    <698>   DW_AT_type        : <0x69c>
 <1><69c>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <69d>   DW_AT_prototyped  : 1
    <69d>   DW_AT_sibling     : <0x6a7>
 <2><6a1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <6a2>   DW_AT_type        : <0x6a7>
 <2><6a6>: Abbrev Number: 0
 <1><6a7>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <6a8>   DW_AT_byte_size   : 4
 <1><6a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <6aa>   DW_AT_name        : (indirect string, offset: 0xbc2d): StackType_t
    <6ae>   DW_AT_decl_file   : 2
    <6af>   DW_AT_decl_line   : 97
    <6b0>   DW_AT_decl_column : 24
    <6b1>   DW_AT_type        : <0x66e>
 <1><6b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <6b6>   DW_AT_name        : (indirect string, offset: 0xb44d): BaseType_t
    <6ba>   DW_AT_decl_file   : 2
    <6bb>   DW_AT_decl_line   : 98
    <6bc>   DW_AT_decl_column : 14
    <6bd>   DW_AT_type        : <0x632>
 <1><6c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <6c2>   DW_AT_name        : (indirect string, offset: 0xb44c): UBaseType_t
    <6c6>   DW_AT_decl_file   : 2
    <6c7>   DW_AT_decl_line   : 99
    <6c8>   DW_AT_decl_column : 23
    <6c9>   DW_AT_type        : <0x645>
 <1><6cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x9a7c): TickType_t
    <6d2>   DW_AT_decl_file   : 2
    <6d3>   DW_AT_decl_line   : 105
    <6d4>   DW_AT_decl_column : 19
    <6d5>   DW_AT_type        : <0x66e>
 <1><6d9>: Abbrev Number: 1 (DW_TAG_base_type)
    <6da>   DW_AT_byte_size   : 1
    <6db>   DW_AT_encoding    : 8	(unsigned char)
    <6dc>   DW_AT_name        : (indirect string, offset: 0x692f): char
 <1><6e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6e1>   DW_AT_byte_size   : 4
    <6e1>   DW_AT_type        : <0x6a9>
 <1><6e5>: Abbrev Number: 8 (DW_TAG_variable)
    <6e6>   DW_AT_name        : (indirect string, offset: 0xbaa3): uxCriticalNesting
    <6ea>   DW_AT_decl_file   : 1
    <6ea>   DW_AT_decl_line   : 157
    <6eb>   DW_AT_decl_column : 20
    <6ec>   DW_AT_type        : <0x6c1>
    <6f0>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><6f6>: Abbrev Number: 8 (DW_TAG_variable)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xb5ba): ucMaxSysCallPriority
    <6fb>   DW_AT_decl_file   : 1
    <6fb>   DW_AT_decl_line   : 219
    <6fc>   DW_AT_decl_column : 18
    <6fd>   DW_AT_type        : <0x653>
    <701>   DW_AT_location    : 5 byte block: 3 1c 87 0 20 	(DW_OP_addr: 2000871c)
 <1><707>: Abbrev Number: 8 (DW_TAG_variable)
    <708>   DW_AT_name        : (indirect string, offset: 0xbbb9): ulMaxPRIGROUPValue
    <70c>   DW_AT_decl_file   : 1
    <70c>   DW_AT_decl_line   : 220
    <70d>   DW_AT_decl_column : 19
    <70e>   DW_AT_type        : <0x66e>
    <712>   DW_AT_location    : 5 byte block: 3 20 87 0 20 	(DW_OP_addr: 20008720)
 <1><718>: Abbrev Number: 8 (DW_TAG_variable)
    <719>   DW_AT_name        : (indirect string, offset: 0xb497): pcInterruptPriorityRegisters
    <71d>   DW_AT_decl_file   : 1
    <71d>   DW_AT_decl_line   : 221
    <71e>   DW_AT_decl_column : 41
    <71f>   DW_AT_type        : <0x72e>
    <723>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><729>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <72a>   DW_AT_byte_size   : 4
    <72a>   DW_AT_type        : <0x664>
 <1><72e>: Abbrev Number: 10 (DW_TAG_const_type)
    <72f>   DW_AT_type        : <0x729>
 <1><733>: Abbrev Number: 22 (DW_TAG_subprogram)
    <734>   DW_AT_external    : 1
    <734>   DW_AT_name        : (indirect string, offset: 0xba90): xTaskIncrementTick
    <738>   DW_AT_decl_file   : 7
    <739>   DW_AT_decl_line   : 2343
    <73b>   DW_AT_decl_column : 12
    <73c>   DW_AT_prototyped  : 1
    <73c>   DW_AT_type        : <0x6b5>
    <740>   DW_AT_declaration : 1
 <1><740>: Abbrev Number: 9 (DW_TAG_subprogram)
    <741>   DW_AT_external    : 1
    <741>   DW_AT_name        : (indirect string, offset: 0xbc39): vPortValidateInterruptPriority
    <745>   DW_AT_decl_file   : 1
    <745>   DW_AT_decl_line   : 705
    <747>   DW_AT_decl_column : 7
    <748>   DW_AT_prototyped  : 1
    <748>   DW_AT_low_pc      : 0x8001748
    <74c>   DW_AT_high_pc     : 0x84
    <750>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <752>   DW_AT_call_all_calls: 1
    <752>   DW_AT_sibling     : <0x7ab>
 <2><756>: Abbrev Number: 6 (DW_TAG_variable)
    <757>   DW_AT_name        : (indirect string, offset: 0xb600): ulCurrentInterrupt
    <75b>   DW_AT_decl_file   : 1
    <75b>   DW_AT_decl_line   : 707
    <75d>   DW_AT_decl_column : 11
    <75e>   DW_AT_type        : <0x66e>
    <762>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><765>: Abbrev Number: 6 (DW_TAG_variable)
    <766>   DW_AT_name        : (indirect string, offset: 0xb4b4): ucCurrentPriority
    <76a>   DW_AT_decl_file   : 1
    <76a>   DW_AT_decl_line   : 708
    <76c>   DW_AT_decl_column : 10
    <76d>   DW_AT_type        : <0x653>
    <771>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><774>: Abbrev Number: 5 (DW_TAG_inlined_subroutine)
    <775>   DW_AT_abstract_origin: <0xa5e>
    <779>   DW_AT_low_pc      : 0x800176e
    <77d>   DW_AT_high_pc     : 0x14
    <781>   DW_AT_call_file   : 1
    <781>   DW_AT_call_line   : 742
    <783>   DW_AT_call_column : 4
    <784>   DW_AT_sibling     : <0x791>
 <3><788>: Abbrev Number: 2 (DW_TAG_variable)
    <789>   DW_AT_abstract_origin: <0xa67>
    <78d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><790>: Abbrev Number: 0
 <2><791>: Abbrev Number: 4 (DW_TAG_inlined_subroutine)
    <792>   DW_AT_abstract_origin: <0xa5e>
    <796>   DW_AT_low_pc      : 0x8001796
    <79a>   DW_AT_high_pc     : 0x14
    <79e>   DW_AT_call_file   : 1
    <79e>   DW_AT_call_line   : 758
    <7a0>   DW_AT_call_column : 3
 <3><7a1>: Abbrev Number: 2 (DW_TAG_variable)
    <7a2>   DW_AT_abstract_origin: <0xa67>
    <7a6>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><7a9>: Abbrev Number: 0
 <2><7aa>: Abbrev Number: 0
 <1><7ab>: Abbrev Number: 14 (DW_TAG_subprogram)
    <7ac>   DW_AT_name        : (indirect string, offset: 0xb9ef): vPortEnableVFP
    <7b0>   DW_AT_decl_file   : 1
    <7b0>   DW_AT_decl_line   : 689
    <7b2>   DW_AT_decl_column : 13
    <7b2>   DW_AT_prototyped  : 1
    <7b2>   DW_AT_low_pc      : 0x8001734
    <7b6>   DW_AT_high_pc     : 0x10
    <7ba>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7bc>   DW_AT_call_all_calls: 1
 <1><7bc>: Abbrev Number: 12 (DW_TAG_subprogram)
    <7bd>   DW_AT_external    : 1
    <7bd>   DW_AT_name        : (indirect string, offset: 0xb9d6): vPortSetupTimerInterrupt
    <7c1>   DW_AT_decl_file   : 1
    <7c1>   DW_AT_decl_line   : 671
    <7c3>   DW_AT_decl_column : 30
    <7c4>   DW_AT_prototyped  : 1
    <7c4>   DW_AT_low_pc      : 0x80016fc
    <7c8>   DW_AT_high_pc     : 0x38
    <7cc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7ce>   DW_AT_call_all_calls: 1
 <1><7ce>: Abbrev Number: 23 (DW_TAG_subprogram)
    <7cf>   DW_AT_external    : 1
    <7cf>   DW_AT_name        : (indirect string, offset: 0xb613): xPortSysTickHandler
    <7d3>   DW_AT_decl_file   : 1
    <7d4>   DW_AT_decl_line   : 493
    <7d6>   DW_AT_decl_column : 6
    <7d7>   DW_AT_prototyped  : 1
    <7d7>   DW_AT_low_pc      : 0x80016b8
    <7db>   DW_AT_high_pc     : 0x44
    <7df>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7e1>   DW_AT_call_all_tail_calls: 1
    <7e1>   DW_AT_sibling     : <0x81c>
 <2><7e5>: Abbrev Number: 5 (DW_TAG_inlined_subroutine)
    <7e6>   DW_AT_abstract_origin: <0xa5e>
    <7ea>   DW_AT_low_pc      : 0x80016be
    <7ee>   DW_AT_high_pc     : 0x14
    <7f2>   DW_AT_call_file   : 1
    <7f2>   DW_AT_call_line   : 499
    <7f4>   DW_AT_call_column : 2
    <7f5>   DW_AT_sibling     : <0x802>
 <3><7f9>: Abbrev Number: 2 (DW_TAG_variable)
    <7fa>   DW_AT_abstract_origin: <0xa67>
    <7fe>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><801>: Abbrev Number: 0
 <2><802>: Abbrev Number: 4 (DW_TAG_inlined_subroutine)
    <803>   DW_AT_abstract_origin: <0xa42>
    <807>   DW_AT_low_pc      : 0x80016e8
    <80b>   DW_AT_high_pc     : 0x8
    <80f>   DW_AT_call_file   : 1
    <80f>   DW_AT_call_line   : 509
    <811>   DW_AT_call_column : 2
 <3><812>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <813>   DW_AT_abstract_origin: <0xa50>
    <817>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><81a>: Abbrev Number: 0
 <2><81b>: Abbrev Number: 0
 <1><81c>: Abbrev Number: 12 (DW_TAG_subprogram)
    <81d>   DW_AT_external    : 1
    <81d>   DW_AT_name        : (indirect string, offset: 0x44a2): PendSV_Handler
    <821>   DW_AT_decl_file   : 1
    <821>   DW_AT_decl_line   : 435
    <823>   DW_AT_decl_column : 6
    <824>   DW_AT_prototyped  : 1
    <824>   DW_AT_low_pc      : 0x8001650
    <828>   DW_AT_high_pc     : 0x66
    <82c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <82e>   DW_AT_call_all_calls: 1
 <1><82e>: Abbrev Number: 9 (DW_TAG_subprogram)
    <82f>   DW_AT_external    : 1
    <82f>   DW_AT_name        : (indirect string, offset: 0xb921): vPortExitCritical
    <833>   DW_AT_decl_file   : 1
    <833>   DW_AT_decl_line   : 424
    <835>   DW_AT_decl_column : 6
    <836>   DW_AT_prototyped  : 1
    <836>   DW_AT_low_pc      : 0x80015fc
    <83a>   DW_AT_high_pc     : 0x54
    <83e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <840>   DW_AT_call_all_calls: 1
    <840>   DW_AT_sibling     : <0x87b>
 <2><844>: Abbrev Number: 5 (DW_TAG_inlined_subroutine)
    <845>   DW_AT_abstract_origin: <0xa5e>
    <849>   DW_AT_low_pc      : 0x800160a
    <84d>   DW_AT_high_pc     : 0x14
    <851>   DW_AT_call_file   : 1
    <851>   DW_AT_call_line   : 426
    <853>   DW_AT_call_column : 2
    <854>   DW_AT_sibling     : <0x861>
 <3><858>: Abbrev Number: 2 (DW_TAG_variable)
    <859>   DW_AT_abstract_origin: <0xa67>
    <85d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><860>: Abbrev Number: 0
 <2><861>: Abbrev Number: 4 (DW_TAG_inlined_subroutine)
    <862>   DW_AT_abstract_origin: <0xa42>
    <866>   DW_AT_low_pc      : 0x8001638
    <86a>   DW_AT_high_pc     : 0x8
    <86e>   DW_AT_call_file   : 1
    <86e>   DW_AT_call_line   : 430
    <870>   DW_AT_call_column : 3
 <3><871>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <872>   DW_AT_abstract_origin: <0xa50>
    <876>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><879>: Abbrev Number: 0
 <2><87a>: Abbrev Number: 0
 <1><87b>: Abbrev Number: 9 (DW_TAG_subprogram)
    <87c>   DW_AT_external    : 1
    <87c>   DW_AT_name        : (indirect string, offset: 0xba7d): vPortEnterCritical
    <880>   DW_AT_decl_file   : 1
    <880>   DW_AT_decl_line   : 407
    <882>   DW_AT_decl_column : 6
    <883>   DW_AT_prototyped  : 1
    <883>   DW_AT_low_pc      : 0x8001598
    <887>   DW_AT_high_pc     : 0x64
    <88b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <88d>   DW_AT_call_all_calls: 1
    <88d>   DW_AT_sibling     : <0x8c8>
 <2><891>: Abbrev Number: 5 (DW_TAG_inlined_subroutine)
    <892>   DW_AT_abstract_origin: <0xa5e>
    <896>   DW_AT_low_pc      : 0x800159e
    <89a>   DW_AT_high_pc     : 0x14
    <89e>   DW_AT_call_file   : 1
    <89e>   DW_AT_call_line   : 409
    <8a0>   DW_AT_call_column : 2
    <8a1>   DW_AT_sibling     : <0x8ae>
 <3><8a5>: Abbrev Number: 2 (DW_TAG_variable)
    <8a6>   DW_AT_abstract_origin: <0xa67>
    <8aa>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><8ad>: Abbrev Number: 0
 <2><8ae>: Abbrev Number: 4 (DW_TAG_inlined_subroutine)
    <8af>   DW_AT_abstract_origin: <0xa5e>
    <8b3>   DW_AT_low_pc      : 0x80015ce
    <8b7>   DW_AT_high_pc     : 0x14
    <8bb>   DW_AT_call_file   : 1
    <8bb>   DW_AT_call_line   : 419
    <8bd>   DW_AT_call_column : 3
 <3><8be>: Abbrev Number: 2 (DW_TAG_variable)
    <8bf>   DW_AT_abstract_origin: <0xa67>
    <8c3>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><8c6>: Abbrev Number: 0
 <2><8c7>: Abbrev Number: 0
 <1><8c8>: Abbrev Number: 9 (DW_TAG_subprogram)
    <8c9>   DW_AT_external    : 1
    <8c9>   DW_AT_name        : (indirect string, offset: 0xb95e): vPortEndScheduler
    <8cd>   DW_AT_decl_file   : 1
    <8cd>   DW_AT_decl_line   : 399
    <8cf>   DW_AT_decl_column : 6
    <8d0>   DW_AT_prototyped  : 1
    <8d0>   DW_AT_low_pc      : 0
    <8d4>   DW_AT_high_pc     : 0x38
    <8d8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8da>   DW_AT_call_all_calls: 1
    <8da>   DW_AT_sibling     : <0x8f8>
 <2><8de>: Abbrev Number: 4 (DW_TAG_inlined_subroutine)
    <8df>   DW_AT_abstract_origin: <0xa5e>
    <8e3>   DW_AT_low_pc      : 0
    <8e7>   DW_AT_high_pc     : 0x14
    <8eb>   DW_AT_call_file   : 1
    <8eb>   DW_AT_call_line   : 403
    <8ed>   DW_AT_call_column : 2
 <3><8ee>: Abbrev Number: 2 (DW_TAG_variable)
    <8ef>   DW_AT_abstract_origin: <0xa67>
    <8f3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><8f6>: Abbrev Number: 0
 <2><8f7>: Abbrev Number: 0
 <1><8f8>: Abbrev Number: 24 (DW_TAG_subprogram)
    <8f9>   DW_AT_external    : 1
    <8f9>   DW_AT_name        : (indirect string, offset: 0xb7f3): xPortStartScheduler
    <8fd>   DW_AT_decl_file   : 1
    <8fe>   DW_AT_decl_line   : 312
    <900>   DW_AT_decl_column : 12
    <901>   DW_AT_prototyped  : 1
    <901>   DW_AT_type        : <0x6b5>
    <905>   DW_AT_low_pc      : 0x8001478
    <909>   DW_AT_high_pc     : 0x120
    <90d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <90f>   DW_AT_call_all_tail_calls: 1
    <90f>   DW_AT_sibling     : <0x985>
 <2><913>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <914>   DW_AT_low_pc      : 0x80014c2
    <918>   DW_AT_high_pc     : 0x6e
    <91c>   DW_AT_sibling     : <0x94e>
 <3><920>: Abbrev Number: 6 (DW_TAG_variable)
    <921>   DW_AT_name        : (indirect string, offset: 0xb8b4): ulOriginalPriority
    <925>   DW_AT_decl_file   : 1
    <925>   DW_AT_decl_line   : 326
    <927>   DW_AT_decl_column : 21
    <928>   DW_AT_type        : <0x67a>
    <92c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><92f>: Abbrev Number: 6 (DW_TAG_variable)
    <930>   DW_AT_name        : (indirect string, offset: 0xbacb): pucFirstUserPriorityRegister
    <934>   DW_AT_decl_file   : 1
    <934>   DW_AT_decl_line   : 327
    <936>   DW_AT_decl_column : 28
    <937>   DW_AT_type        : <0x98a>
    <93b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><93e>: Abbrev Number: 6 (DW_TAG_variable)
    <93f>   DW_AT_name        : (indirect string, offset: 0xb8c7): ucMaxPriorityValue
    <943>   DW_AT_decl_file   : 1
    <943>   DW_AT_decl_line   : 328
    <945>   DW_AT_decl_column : 20
    <946>   DW_AT_type        : <0x669>
    <94a>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <3><94d>: Abbrev Number: 0
 <2><94e>: Abbrev Number: 5 (DW_TAG_inlined_subroutine)
    <94f>   DW_AT_abstract_origin: <0xa5e>
    <953>   DW_AT_low_pc      : 0x8001488
    <957>   DW_AT_high_pc     : 0x14
    <95b>   DW_AT_call_file   : 1
    <95b>   DW_AT_call_line   : 321
    <95d>   DW_AT_call_column : 2
    <95e>   DW_AT_sibling     : <0x96b>
 <3><962>: Abbrev Number: 2 (DW_TAG_variable)
    <963>   DW_AT_abstract_origin: <0xa67>
    <967>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><96a>: Abbrev Number: 0
 <2><96b>: Abbrev Number: 4 (DW_TAG_inlined_subroutine)
    <96c>   DW_AT_abstract_origin: <0xa5e>
    <970>   DW_AT_low_pc      : 0x80014aa
    <974>   DW_AT_high_pc     : 0x14
    <978>   DW_AT_call_file   : 1
    <978>   DW_AT_call_line   : 322
    <97a>   DW_AT_call_column : 2
 <3><97b>: Abbrev Number: 2 (DW_TAG_variable)
    <97c>   DW_AT_abstract_origin: <0xa67>
    <980>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><983>: Abbrev Number: 0
 <2><984>: Abbrev Number: 0
 <1><985>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <986>   DW_AT_byte_size   : 4
    <986>   DW_AT_type        : <0x669>
 <1><98a>: Abbrev Number: 10 (DW_TAG_const_type)
    <98b>   DW_AT_type        : <0x985>
 <1><98f>: Abbrev Number: 14 (DW_TAG_subprogram)
    <990>   DW_AT_name        : (indirect string, offset: 0xbab5): prvPortStartFirstTask
    <994>   DW_AT_decl_file   : 1
    <994>   DW_AT_decl_line   : 292
    <996>   DW_AT_decl_column : 13
    <996>   DW_AT_prototyped  : 1
    <996>   DW_AT_low_pc      : 0x8001458
    <99a>   DW_AT_high_pc     : 0x1c
    <99e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9a0>   DW_AT_call_all_calls: 1
 <1><9a0>: Abbrev Number: 12 (DW_TAG_subprogram)
    <9a1>   DW_AT_external    : 1
    <9a1>   DW_AT_name        : (indirect string, offset: 0x8cd4): SVC_Handler
    <9a5>   DW_AT_decl_file   : 1
    <9a5>   DW_AT_decl_line   : 273
    <9a7>   DW_AT_decl_column : 6
    <9a8>   DW_AT_prototyped  : 1
    <9a8>   DW_AT_low_pc      : 0x8001430
    <9ac>   DW_AT_high_pc     : 0x26
    <9b0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9b2>   DW_AT_call_all_calls: 1
 <1><9b2>: Abbrev Number: 26 (DW_TAG_subprogram)
    <9b3>   DW_AT_name        : (indirect string, offset: 0xbcd2): prvTaskExitError
    <9b7>   DW_AT_decl_file   : 1
    <9b8>   DW_AT_decl_line   : 259
    <9ba>   DW_AT_decl_column : 13
    <9bb>   DW_AT_prototyped  : 1
    <9bb>   DW_AT_low_pc      : 0x80013ec
    <9bf>   DW_AT_high_pc     : 0x44
    <9c3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9c5>   DW_AT_call_all_calls: 1
    <9c5>   DW_AT_sibling     : <0xa00>
 <2><9c9>: Abbrev Number: 5 (DW_TAG_inlined_subroutine)
    <9ca>   DW_AT_abstract_origin: <0xa5e>
    <9ce>   DW_AT_low_pc      : 0x80013fc
    <9d2>   DW_AT_high_pc     : 0x14
    <9d6>   DW_AT_call_file   : 1
    <9d6>   DW_AT_call_line   : 267
    <9d8>   DW_AT_call_column : 2
    <9d9>   DW_AT_sibling     : <0x9e6>
 <3><9dd>: Abbrev Number: 2 (DW_TAG_variable)
    <9de>   DW_AT_abstract_origin: <0xa67>
    <9e2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><9e5>: Abbrev Number: 0
 <2><9e6>: Abbrev Number: 4 (DW_TAG_inlined_subroutine)
    <9e7>   DW_AT_abstract_origin: <0xa5e>
    <9eb>   DW_AT_low_pc      : 0x8001414
    <9ef>   DW_AT_high_pc     : 0x14
    <9f3>   DW_AT_call_file   : 1
    <9f3>   DW_AT_call_line   : 268
    <9f5>   DW_AT_call_column : 2
 <3><9f6>: Abbrev Number: 2 (DW_TAG_variable)
    <9f7>   DW_AT_abstract_origin: <0xa67>
    <9fb>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><9fe>: Abbrev Number: 0
 <2><9ff>: Abbrev Number: 0
 <1><a00>: Abbrev Number: 27 (DW_TAG_subprogram)
    <a01>   DW_AT_external    : 1
    <a01>   DW_AT_name        : (indirect string, offset: 0xb76b): pxPortInitialiseStack
    <a05>   DW_AT_decl_file   : 1
    <a06>   DW_AT_decl_line   : 229
    <a07>   DW_AT_decl_column : 14
    <a08>   DW_AT_prototyped  : 1
    <a08>   DW_AT_type        : <0x6e0>
    <a0c>   DW_AT_low_pc      : 0x8001384
    <a10>   DW_AT_high_pc     : 0x68
    <a14>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a16>   DW_AT_call_all_calls: 1
    <a16>   DW_AT_sibling     : <0xa42>
 <2><a1a>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <a1b>   DW_AT_name        : (indirect string, offset: 0xb710): pxTopOfStack
    <a1f>   DW_AT_decl_file   : 1
    <a1f>   DW_AT_decl_line   : 229
    <a1f>   DW_AT_decl_column : 50
    <a20>   DW_AT_type        : <0x6e0>
    <a24>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a27>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <a28>   DW_AT_name        : (indirect string, offset: 0xbbb2): pxCode
    <a2c>   DW_AT_decl_file   : 1
    <a2c>   DW_AT_decl_line   : 229
    <a2c>   DW_AT_decl_column : 79
    <a2d>   DW_AT_type        : <0x68b>
    <a31>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a34>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <a35>   DW_AT_name        : (indirect string, offset: 0xbb54): pvParameters
    <a39>   DW_AT_decl_file   : 1
    <a39>   DW_AT_decl_line   : 229
    <a39>   DW_AT_decl_column : 93
    <a3a>   DW_AT_type        : <0x6a7>
    <a3e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 28 (DW_TAG_subprogram)
    <a43>   DW_AT_name        : (indirect string, offset: 0xb6bd): vPortSetBASEPRI
    <a47>   DW_AT_decl_file   : 2
    <a48>   DW_AT_decl_line   : 269
    <a4a>   DW_AT_decl_column : 30
    <a4b>   DW_AT_prototyped  : 1
    <a4b>   DW_AT_inline      : 3	(declared as inline and inlined)
    <a4c>   DW_AT_sibling     : <0xa5e>
 <2><a50>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <a51>   DW_AT_name        : (indirect string, offset: 0xb6ae): ulNewMaskValue
    <a55>   DW_AT_decl_file   : 2
    <a56>   DW_AT_decl_line   : 269
    <a58>   DW_AT_decl_column : 56
    <a59>   DW_AT_type        : <0x66e>
 <2><a5d>: Abbrev Number: 0
 <1><a5e>: Abbrev Number: 30 (DW_TAG_subprogram)
    <a5f>   DW_AT_name        : (indirect string, offset: 0xbae8): vPortRaiseBASEPRI
    <a63>   DW_AT_decl_file   : 2
    <a64>   DW_AT_decl_line   : 233
    <a65>   DW_AT_decl_column : 30
    <a66>   DW_AT_prototyped  : 1
    <a66>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><a67>: Abbrev Number: 31 (DW_TAG_variable)
    <a68>   DW_AT_name        : (indirect string, offset: 0xb9c9): ulNewBASEPRI
    <a6c>   DW_AT_decl_file   : 2
    <a6d>   DW_AT_decl_line   : 235
    <a6e>   DW_AT_decl_column : 10
    <a6f>   DW_AT_type        : <0x66e>
 <2><a73>: Abbrev Number: 0
 <1><a74>: Abbrev Number: 0
  Compilation Unit @ offset 0xa75:
   Length:        0x1add (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x4a2
   Pointer Size:  4
 <0><a81>: Abbrev Number: 39 (DW_TAG_compile_unit)
    <a82>   DW_AT_producer    : (indirect string, offset: 0x7ae7): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a86>   DW_AT_language    : 29	(C11)
    <a87>   DW_AT_name        : (indirect string, offset: 0xc538): ../Core/Src/FreeRTOS/queue.c
    <a8b>   DW_AT_comp_dir    : (indirect string, offset: 0x707d): C:/Github/RTOS-Machine-Fault-Diagnosis/Debug
    <a8f>   DW_AT_ranges      : 0xc0
    <a93>   DW_AT_low_pc      : 0
    <a97>   DW_AT_stmt_list   : 0x1751
    <a9b>   DW_AT_macros      : 0x508
 <1><a9f>: Abbrev Number: 7 (DW_TAG_typedef)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x55ae): size_t
    <aa4>   DW_AT_decl_file   : 3
    <aa5>   DW_AT_decl_line   : 214
    <aa6>   DW_AT_decl_column : 23
    <aa7>   DW_AT_type        : <0xab0>
 <1><aab>: Abbrev Number: 24 (DW_TAG_volatile_type)
    <aac>   DW_AT_type        : <0xa9f>
 <1><ab0>: Abbrev Number: 13 (DW_TAG_base_type)
    <ab1>   DW_AT_byte_size   : 4
    <ab2>   DW_AT_encoding    : 7	(unsigned)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x2b03): unsigned int
 <1><ab7>: Abbrev Number: 40 (DW_TAG_base_type)
    <ab8>   DW_AT_byte_size   : 4
    <ab9>   DW_AT_encoding    : 5	(signed)
    <aba>   DW_AT_name        : int
 <1><abe>: Abbrev Number: 13 (DW_TAG_base_type)
    <abf>   DW_AT_byte_size   : 8
    <ac0>   DW_AT_encoding    : 5	(signed)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x625a): long long int
 <1><ac5>: Abbrev Number: 13 (DW_TAG_base_type)
    <ac6>   DW_AT_byte_size   : 8
    <ac7>   DW_AT_encoding    : 4	(float)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x3d1): long double
 <1><acc>: Abbrev Number: 7 (DW_TAG_typedef)
    <acd>   DW_AT_name        : (indirect string, offset: 0xcf5e): __int8_t
    <ad1>   DW_AT_decl_file   : 4
    <ad2>   DW_AT_decl_line   : 41
    <ad3>   DW_AT_decl_column : 23
    <ad4>   DW_AT_type        : <0xad8>
 <1><ad8>: Abbrev Number: 13 (DW_TAG_base_type)
    <ad9>   DW_AT_byte_size   : 1
    <ada>   DW_AT_encoding    : 6	(signed char)
    <adb>   DW_AT_name        : (indirect string, offset: 0x7344): signed char
 <1><adf>: Abbrev Number: 7 (DW_TAG_typedef)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x1595): __uint8_t
    <ae4>   DW_AT_decl_file   : 4
    <ae5>   DW_AT_decl_line   : 43
    <ae6>   DW_AT_decl_column : 24
    <ae7>   DW_AT_type        : <0xaeb>
 <1><aeb>: Abbrev Number: 13 (DW_TAG_base_type)
    <aec>   DW_AT_byte_size   : 1
    <aed>   DW_AT_encoding    : 8	(unsigned char)
    <aee>   DW_AT_name        : (indirect string, offset: 0x3eb2): unsigned char
 <1><af2>: Abbrev Number: 13 (DW_TAG_base_type)
    <af3>   DW_AT_byte_size   : 2
    <af4>   DW_AT_encoding    : 5	(signed)
    <af5>   DW_AT_name        : (indirect string, offset: 0xbbe): short int
 <1><af9>: Abbrev Number: 13 (DW_TAG_base_type)
    <afa>   DW_AT_byte_size   : 2
    <afb>   DW_AT_encoding    : 7	(unsigned)
    <afc>   DW_AT_name        : (indirect string, offset: 0x82fc): short unsigned int
 <1><b00>: Abbrev Number: 13 (DW_TAG_base_type)
    <b01>   DW_AT_byte_size   : 4
    <b02>   DW_AT_encoding    : 5	(signed)
    <b03>   DW_AT_name        : (indirect string, offset: 0x87c9): long int
 <1><b07>: Abbrev Number: 7 (DW_TAG_typedef)
    <b08>   DW_AT_name        : (indirect string, offset: 0x4efb): __uint32_t
    <b0c>   DW_AT_decl_file   : 4
    <b0d>   DW_AT_decl_line   : 79
    <b0e>   DW_AT_decl_column : 25
    <b0f>   DW_AT_type        : <0xb13>
 <1><b13>: Abbrev Number: 13 (DW_TAG_base_type)
    <b14>   DW_AT_byte_size   : 4
    <b15>   DW_AT_encoding    : 7	(unsigned)
    <b16>   DW_AT_name        : (indirect string, offset: 0x21f2): long unsigned int
 <1><b1a>: Abbrev Number: 13 (DW_TAG_base_type)
    <b1b>   DW_AT_byte_size   : 8
    <b1c>   DW_AT_encoding    : 7	(unsigned)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x26fc): long long unsigned int
 <1><b21>: Abbrev Number: 41 (DW_TAG_pointer_type)
    <b22>   DW_AT_byte_size   : 4
 <1><b23>: Abbrev Number: 8 (DW_TAG_const_type)
    <b24>   DW_AT_type        : <0xb21>
 <1><b28>: Abbrev Number: 13 (DW_TAG_base_type)
    <b29>   DW_AT_byte_size   : 1
    <b2a>   DW_AT_encoding    : 8	(unsigned char)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x692f): char
 <1><b2f>: Abbrev Number: 8 (DW_TAG_const_type)
    <b30>   DW_AT_type        : <0xb28>
 <1><b34>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <b35>   DW_AT_byte_size   : 4
    <b35>   DW_AT_type        : <0xb2f>
 <1><b39>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <b3a>   DW_AT_byte_size   : 4
    <b3a>   DW_AT_type        : <0xb43>
 <1><b3e>: Abbrev Number: 8 (DW_TAG_const_type)
    <b3f>   DW_AT_type        : <0xb39>
 <1><b43>: Abbrev Number: 42 (DW_TAG_const_type)
 <1><b44>: Abbrev Number: 7 (DW_TAG_typedef)
    <b45>   DW_AT_name        : (indirect string, offset: 0xcf60): int8_t
    <b49>   DW_AT_decl_file   : 5
    <b4a>   DW_AT_decl_line   : 20
    <b4b>   DW_AT_decl_column : 18
    <b4c>   DW_AT_type        : <0xacc>
 <1><b50>: Abbrev Number: 24 (DW_TAG_volatile_type)
    <b51>   DW_AT_type        : <0xb44>
 <1><b55>: Abbrev Number: 8 (DW_TAG_const_type)
    <b56>   DW_AT_type        : <0xb44>
 <1><b5a>: Abbrev Number: 7 (DW_TAG_typedef)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x1597): uint8_t
    <b5f>   DW_AT_decl_file   : 5
    <b60>   DW_AT_decl_line   : 24
    <b61>   DW_AT_decl_column : 19
    <b62>   DW_AT_type        : <0xadf>
 <1><b66>: Abbrev Number: 8 (DW_TAG_const_type)
    <b67>   DW_AT_type        : <0xb5a>
 <1><b6b>: Abbrev Number: 7 (DW_TAG_typedef)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xa274): uint32_t
    <b70>   DW_AT_decl_file   : 5
    <b71>   DW_AT_decl_line   : 48
    <b72>   DW_AT_decl_column : 20
    <b73>   DW_AT_type        : <0xb07>
 <1><b77>: Abbrev Number: 7 (DW_TAG_typedef)
    <b78>   DW_AT_name        : (indirect string, offset: 0xb44d): BaseType_t
    <b7c>   DW_AT_decl_file   : 2
    <b7d>   DW_AT_decl_line   : 98
    <b7e>   DW_AT_decl_column : 14
    <b7f>   DW_AT_type        : <0xb00>
 <1><b83>: Abbrev Number: 8 (DW_TAG_const_type)
    <b84>   DW_AT_type        : <0xb77>
 <1><b88>: Abbrev Number: 7 (DW_TAG_typedef)
    <b89>   DW_AT_name        : (indirect string, offset: 0xb44c): UBaseType_t
    <b8d>   DW_AT_decl_file   : 2
    <b8e>   DW_AT_decl_line   : 99
    <b8f>   DW_AT_decl_column : 23
    <b90>   DW_AT_type        : <0xb13>
 <1><b94>: Abbrev Number: 24 (DW_TAG_volatile_type)
    <b95>   DW_AT_type        : <0xb88>
 <1><b99>: Abbrev Number: 8 (DW_TAG_const_type)
    <b9a>   DW_AT_type        : <0xb88>
 <1><b9e>: Abbrev Number: 7 (DW_TAG_typedef)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x9a7c): TickType_t
    <ba3>   DW_AT_decl_file   : 2
    <ba4>   DW_AT_decl_line   : 105
    <ba5>   DW_AT_decl_column : 19
    <ba6>   DW_AT_type        : <0xb6b>
 <1><baa>: Abbrev Number: 8 (DW_TAG_const_type)
    <bab>   DW_AT_type        : <0xb9e>
 <1><baf>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <bb0>   DW_AT_byte_size   : 4
    <bb0>   DW_AT_type        : <0xb5a>
 <1><bb4>: Abbrev Number: 25 (DW_TAG_structure_type)
    <bb5>   DW_AT_name        : (indirect string, offset: 0xccdf): xSTATIC_MINI_LIST_ITEM
    <bb9>   DW_AT_byte_size   : 12
    <bba>   DW_AT_decl_file   : 6
    <bba>   DW_AT_decl_line   : 1075
    <bbc>   DW_AT_decl_column : 8
    <bbd>   DW_AT_sibling     : <0xbdc>
 <2><bc1>: Abbrev Number: 12 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0xc0a3): xDummy2
    <bc6>   DW_AT_decl_file   : 6
    <bc6>   DW_AT_decl_line   : 1080
    <bc8>   DW_AT_decl_column : 13
    <bc9>   DW_AT_type        : <0xb9e>
    <bcd>   DW_AT_data_member_location: 0
 <2><bce>: Abbrev Number: 12 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0xc9de): pvDummy3
    <bd3>   DW_AT_decl_file   : 6
    <bd3>   DW_AT_decl_line   : 1081
    <bd5>   DW_AT_decl_column : 8
    <bd6>   DW_AT_type        : <0xbdc>
    <bda>   DW_AT_data_member_location: 4
 <2><bdb>: Abbrev Number: 0
 <1><bdc>: Abbrev Number: 16 (DW_TAG_array_type)
    <bdd>   DW_AT_type        : <0xb21>
    <be1>   DW_AT_sibling     : <0xbec>
 <2><be5>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <be6>   DW_AT_type        : <0xab0>
    <bea>   DW_AT_upper_bound : 1
 <2><beb>: Abbrev Number: 0
 <1><bec>: Abbrev Number: 26 (DW_TAG_typedef)
    <bed>   DW_AT_name        : (indirect string, offset: 0xc958): StaticMiniListItem_t
    <bf1>   DW_AT_decl_file   : 6
    <bf1>   DW_AT_decl_line   : 1083
    <bf3>   DW_AT_decl_column : 39
    <bf4>   DW_AT_type        : <0xbb4>
 <1><bf8>: Abbrev Number: 25 (DW_TAG_structure_type)
    <bf9>   DW_AT_name        : (indirect string, offset: 0xcc43): xSTATIC_LIST
    <bfd>   DW_AT_byte_size   : 20
    <bfe>   DW_AT_decl_file   : 6
    <bfe>   DW_AT_decl_line   : 1086
    <c00>   DW_AT_decl_column : 16
    <c01>   DW_AT_sibling     : <0xc2d>
 <2><c05>: Abbrev Number: 12 (DW_TAG_member)
    <c06>   DW_AT_name        : (indirect string, offset: 0xc0a2): uxDummy2
    <c0a>   DW_AT_decl_file   : 6
    <c0a>   DW_AT_decl_line   : 1091
    <c0c>   DW_AT_decl_column : 14
    <c0d>   DW_AT_type        : <0xb88>
    <c11>   DW_AT_data_member_location: 0
 <2><c12>: Abbrev Number: 12 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0xc9de): pvDummy3
    <c17>   DW_AT_decl_file   : 6
    <c17>   DW_AT_decl_line   : 1092
    <c19>   DW_AT_decl_column : 8
    <c1a>   DW_AT_type        : <0xb21>
    <c1e>   DW_AT_data_member_location: 4
 <2><c1f>: Abbrev Number: 12 (DW_TAG_member)
    <c20>   DW_AT_name        : (indirect string, offset: 0xc0ac): xDummy4
    <c24>   DW_AT_decl_file   : 6
    <c24>   DW_AT_decl_line   : 1093
    <c26>   DW_AT_decl_column : 23
    <c27>   DW_AT_type        : <0xbec>
    <c2b>   DW_AT_data_member_location: 8
 <2><c2c>: Abbrev Number: 0
 <1><c2d>: Abbrev Number: 26 (DW_TAG_typedef)
    <c2e>   DW_AT_name        : (indirect string, offset: 0xc62d): StaticList_t
    <c32>   DW_AT_decl_file   : 6
    <c32>   DW_AT_decl_line   : 1097
    <c34>   DW_AT_decl_column : 3
    <c35>   DW_AT_type        : <0xbf8>
 <1><c39>: Abbrev Number: 43 (DW_TAG_union_type)
    <c3a>   DW_AT_byte_size   : 4
    <c3b>   DW_AT_decl_file   : 6
    <c3c>   DW_AT_decl_line   : 1180
    <c3e>   DW_AT_decl_column : 2
    <c3f>   DW_AT_sibling     : <0xc5c>
 <2><c43>: Abbrev Number: 33 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0xc9d5): pvDummy2
    <c48>   DW_AT_decl_file   : 6
    <c48>   DW_AT_decl_line   : 1182
    <c4a>   DW_AT_decl_column : 9
    <c4b>   DW_AT_type        : <0xb21>
 <2><c4f>: Abbrev Number: 33 (DW_TAG_member)
    <c50>   DW_AT_name        : (indirect string, offset: 0xc0a2): uxDummy2
    <c54>   DW_AT_decl_file   : 6
    <c54>   DW_AT_decl_line   : 1183
    <c56>   DW_AT_decl_column : 15
    <c57>   DW_AT_type        : <0xb88>
 <2><c5b>: Abbrev Number: 0
 <1><c5c>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c5d>   DW_AT_name        : (indirect string, offset: 0xca51): xSTATIC_QUEUE
    <c61>   DW_AT_byte_size   : 80
    <c62>   DW_AT_decl_file   : 6
    <c62>   DW_AT_decl_line   : 1176
    <c64>   DW_AT_decl_column : 16
    <c65>   DW_AT_sibling     : <0xcd1>
 <2><c69>: Abbrev Number: 12 (DW_TAG_member)
    <c6a>   DW_AT_name        : (indirect string, offset: 0xc9cc): pvDummy1
    <c6e>   DW_AT_decl_file   : 6
    <c6e>   DW_AT_decl_line   : 1178
    <c70>   DW_AT_decl_column : 8
    <c71>   DW_AT_type        : <0xcd1>
    <c75>   DW_AT_data_member_location: 0
 <2><c76>: Abbrev Number: 44 (DW_TAG_member)
    <c77>   DW_AT_name        : u
    <c79>   DW_AT_decl_file   : 6
    <c7a>   DW_AT_decl_line   : 1184
    <c7c>   DW_AT_decl_column : 4
    <c7d>   DW_AT_type        : <0xc39>
    <c81>   DW_AT_data_member_location: 12
 <2><c82>: Abbrev Number: 12 (DW_TAG_member)
    <c83>   DW_AT_name        : (indirect string, offset: 0xbe3d): xDummy3
    <c87>   DW_AT_decl_file   : 6
    <c87>   DW_AT_decl_line   : 1186
    <c89>   DW_AT_decl_column : 15
    <c8a>   DW_AT_type        : <0xce1>
    <c8e>   DW_AT_data_member_location: 16
 <2><c8f>: Abbrev Number: 12 (DW_TAG_member)
    <c90>   DW_AT_name        : (indirect string, offset: 0xc0ab): uxDummy4
    <c94>   DW_AT_decl_file   : 6
    <c94>   DW_AT_decl_line   : 1187
    <c96>   DW_AT_decl_column : 14
    <c97>   DW_AT_type        : <0xcf1>
    <c9b>   DW_AT_data_member_location: 56
 <2><c9c>: Abbrev Number: 12 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0xc1fb): ucDummy5
    <ca1>   DW_AT_decl_file   : 6
    <ca1>   DW_AT_decl_line   : 1188
    <ca3>   DW_AT_decl_column : 10
    <ca4>   DW_AT_type        : <0xd01>
    <ca8>   DW_AT_data_member_location: 68
 <2><ca9>: Abbrev Number: 12 (DW_TAG_member)
    <caa>   DW_AT_name        : (indirect string, offset: 0xc204): ucDummy6
    <cae>   DW_AT_decl_file   : 6
    <cae>   DW_AT_decl_line   : 1191
    <cb0>   DW_AT_decl_column : 11
    <cb1>   DW_AT_type        : <0xb5a>
    <cb5>   DW_AT_data_member_location: 70
 <2><cb6>: Abbrev Number: 12 (DW_TAG_member)
    <cb7>   DW_AT_name        : (indirect string, offset: 0xc0b4): uxDummy8
    <cbb>   DW_AT_decl_file   : 6
    <cbb>   DW_AT_decl_line   : 1199
    <cbd>   DW_AT_decl_column : 15
    <cbe>   DW_AT_type        : <0xb88>
    <cc2>   DW_AT_data_member_location: 72
 <2><cc3>: Abbrev Number: 12 (DW_TAG_member)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xc20d): ucDummy9
    <cc8>   DW_AT_decl_file   : 6
    <cc8>   DW_AT_decl_line   : 1200
    <cca>   DW_AT_decl_column : 11
    <ccb>   DW_AT_type        : <0xb5a>
    <ccf>   DW_AT_data_member_location: 76
 <2><cd0>: Abbrev Number: 0
 <1><cd1>: Abbrev Number: 16 (DW_TAG_array_type)
    <cd2>   DW_AT_type        : <0xb21>
    <cd6>   DW_AT_sibling     : <0xce1>
 <2><cda>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <cdb>   DW_AT_type        : <0xab0>
    <cdf>   DW_AT_upper_bound : 2
 <2><ce0>: Abbrev Number: 0
 <1><ce1>: Abbrev Number: 16 (DW_TAG_array_type)
    <ce2>   DW_AT_type        : <0xc2d>
    <ce6>   DW_AT_sibling     : <0xcf1>
 <2><cea>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ceb>   DW_AT_type        : <0xab0>
    <cef>   DW_AT_upper_bound : 1
 <2><cf0>: Abbrev Number: 0
 <1><cf1>: Abbrev Number: 16 (DW_TAG_array_type)
    <cf2>   DW_AT_type        : <0xb88>
    <cf6>   DW_AT_sibling     : <0xd01>
 <2><cfa>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <cfb>   DW_AT_type        : <0xab0>
    <cff>   DW_AT_upper_bound : 2
 <2><d00>: Abbrev Number: 0
 <1><d01>: Abbrev Number: 16 (DW_TAG_array_type)
    <d02>   DW_AT_type        : <0xb5a>
    <d06>   DW_AT_sibling     : <0xd11>
 <2><d0a>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <d0b>   DW_AT_type        : <0xab0>
    <d0f>   DW_AT_upper_bound : 1
 <2><d10>: Abbrev Number: 0
 <1><d11>: Abbrev Number: 26 (DW_TAG_typedef)
    <d12>   DW_AT_name        : (indirect string, offset: 0xc61f): StaticQueue_t
    <d16>   DW_AT_decl_file   : 6
    <d16>   DW_AT_decl_line   : 1203
    <d18>   DW_AT_decl_column : 3
    <d19>   DW_AT_type        : <0xc5c>
 <1><d1d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <d1e>   DW_AT_name        : (indirect string, offset: 0xb3e4): xLIST_ITEM
    <d22>   DW_AT_byte_size   : 20
    <d23>   DW_AT_decl_file   : 7
    <d24>   DW_AT_decl_line   : 140
    <d25>   DW_AT_decl_column : 8
    <d26>   DW_AT_sibling     : <0xd6c>
 <2><d2a>: Abbrev Number: 4 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xb48c): xItemValue
    <d2f>   DW_AT_decl_file   : 7
    <d30>   DW_AT_decl_line   : 143
    <d31>   DW_AT_decl_column : 33
    <d32>   DW_AT_type        : <0xb9e>
    <d36>   DW_AT_data_member_location: 0
 <2><d37>: Abbrev Number: 4 (DW_TAG_member)
    <d38>   DW_AT_name        : (indirect string, offset: 0xb37f): pxNext
    <d3c>   DW_AT_decl_file   : 7
    <d3d>   DW_AT_decl_line   : 144
    <d3e>   DW_AT_decl_column : 42
    <d3f>   DW_AT_type        : <0xd6c>
    <d43>   DW_AT_data_member_location: 4
 <2><d44>: Abbrev Number: 4 (DW_TAG_member)
    <d45>   DW_AT_name        : (indirect string, offset: 0xb458): pxPrevious
    <d49>   DW_AT_decl_file   : 7
    <d4a>   DW_AT_decl_line   : 145
    <d4b>   DW_AT_decl_column : 42
    <d4c>   DW_AT_type        : <0xd6c>
    <d50>   DW_AT_data_member_location: 8
 <2><d51>: Abbrev Number: 4 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0xb438): pvOwner
    <d56>   DW_AT_decl_file   : 7
    <d57>   DW_AT_decl_line   : 146
    <d58>   DW_AT_decl_column : 9
    <d59>   DW_AT_type        : <0xb21>
    <d5d>   DW_AT_data_member_location: 12
 <2><d5e>: Abbrev Number: 4 (DW_TAG_member)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x1a4c): pvContainer
    <d63>   DW_AT_decl_file   : 7
    <d64>   DW_AT_decl_line   : 147
    <d65>   DW_AT_decl_column : 37
    <d66>   DW_AT_type        : <0xda6>
    <d6a>   DW_AT_data_member_location: 16
 <2><d6b>: Abbrev Number: 0
 <1><d6c>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <d6d>   DW_AT_byte_size   : 4
    <d6d>   DW_AT_type        : <0xd1d>
 <1><d71>: Abbrev Number: 15 (DW_TAG_structure_type)
    <d72>   DW_AT_name        : (indirect string, offset: 0xb486): xLIST
    <d76>   DW_AT_byte_size   : 20
    <d77>   DW_AT_decl_file   : 7
    <d78>   DW_AT_decl_line   : 164
    <d79>   DW_AT_decl_column : 16
    <d7a>   DW_AT_sibling     : <0xda6>
 <2><d7e>: Abbrev Number: 4 (DW_TAG_member)
    <d7f>   DW_AT_name        : (indirect string, offset: 0xb40b): uxNumberOfItems
    <d83>   DW_AT_decl_file   : 7
    <d84>   DW_AT_decl_line   : 167
    <d85>   DW_AT_decl_column : 23
    <d86>   DW_AT_type        : <0xb94>
    <d8a>   DW_AT_data_member_location: 0
 <2><d8b>: Abbrev Number: 4 (DW_TAG_member)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xb3ac): pxIndex
    <d90>   DW_AT_decl_file   : 7
    <d91>   DW_AT_decl_line   : 168
    <d92>   DW_AT_decl_column : 35
    <d93>   DW_AT_type        : <0xdf8>
    <d97>   DW_AT_data_member_location: 4
 <2><d98>: Abbrev Number: 4 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0xb41b): xListEnd
    <d9d>   DW_AT_decl_file   : 7
    <d9e>   DW_AT_decl_line   : 169
    <d9f>   DW_AT_decl_column : 17
    <da0>   DW_AT_type        : <0xdec>
    <da4>   DW_AT_data_member_location: 8
 <2><da5>: Abbrev Number: 0
 <1><da6>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <da7>   DW_AT_byte_size   : 4
    <da7>   DW_AT_type        : <0xd71>
 <1><dab>: Abbrev Number: 7 (DW_TAG_typedef)
    <dac>   DW_AT_name        : (indirect string, offset: 0x2e6c): ListItem_t
    <db0>   DW_AT_decl_file   : 7
    <db1>   DW_AT_decl_line   : 150
    <db2>   DW_AT_decl_column : 27
    <db3>   DW_AT_type        : <0xd1d>
 <1><db7>: Abbrev Number: 15 (DW_TAG_structure_type)
    <db8>   DW_AT_name        : (indirect string, offset: 0xb3b4): xMINI_LIST_ITEM
    <dbc>   DW_AT_byte_size   : 12
    <dbd>   DW_AT_decl_file   : 7
    <dbe>   DW_AT_decl_line   : 152
    <dbf>   DW_AT_decl_column : 8
    <dc0>   DW_AT_sibling     : <0xdec>
 <2><dc4>: Abbrev Number: 4 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0xb48c): xItemValue
    <dc9>   DW_AT_decl_file   : 7
    <dca>   DW_AT_decl_line   : 155
    <dcb>   DW_AT_decl_column : 33
    <dcc>   DW_AT_type        : <0xb9e>
    <dd0>   DW_AT_data_member_location: 0
 <2><dd1>: Abbrev Number: 4 (DW_TAG_member)
    <dd2>   DW_AT_name        : (indirect string, offset: 0xb37f): pxNext
    <dd6>   DW_AT_decl_file   : 7
    <dd7>   DW_AT_decl_line   : 156
    <dd8>   DW_AT_decl_column : 42
    <dd9>   DW_AT_type        : <0xd6c>
    <ddd>   DW_AT_data_member_location: 4
 <2><dde>: Abbrev Number: 4 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0xb458): pxPrevious
    <de3>   DW_AT_decl_file   : 7
    <de4>   DW_AT_decl_line   : 157
    <de5>   DW_AT_decl_column : 42
    <de6>   DW_AT_type        : <0xd6c>
    <dea>   DW_AT_data_member_location: 8
 <2><deb>: Abbrev Number: 0
 <1><dec>: Abbrev Number: 7 (DW_TAG_typedef)
    <ded>   DW_AT_name        : (indirect string, offset: 0xc95e): MiniListItem_t
    <df1>   DW_AT_decl_file   : 7
    <df2>   DW_AT_decl_line   : 159
    <df3>   DW_AT_decl_column : 32
    <df4>   DW_AT_type        : <0xdb7>
 <1><df8>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <df9>   DW_AT_byte_size   : 4
    <df9>   DW_AT_type        : <0xdab>
 <1><dfd>: Abbrev Number: 7 (DW_TAG_typedef)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x1aea): List_t
    <e02>   DW_AT_decl_file   : 7
    <e03>   DW_AT_decl_line   : 171
    <e04>   DW_AT_decl_column : 3
    <e05>   DW_AT_type        : <0xd71>
 <1><e09>: Abbrev Number: 8 (DW_TAG_const_type)
    <e0a>   DW_AT_type        : <0xdfd>
 <1><e0e>: Abbrev Number: 7 (DW_TAG_typedef)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x15ab): TaskHandle_t
    <e13>   DW_AT_decl_file   : 8
    <e14>   DW_AT_decl_line   : 70
    <e15>   DW_AT_decl_column : 37
    <e16>   DW_AT_type        : <0xe1f>
 <1><e1a>: Abbrev Number: 8 (DW_TAG_const_type)
    <e1b>   DW_AT_type        : <0xe0e>
 <1><e1f>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <e20>   DW_AT_byte_size   : 4
    <e20>   DW_AT_type        : <0xe24>
 <1><e24>: Abbrev Number: 45 (DW_TAG_structure_type)
    <e25>   DW_AT_name        : (indirect string, offset: 0xc6b9): tskTaskControlBlock
    <e29>   DW_AT_declaration : 1
 <1><e29>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e2a>   DW_AT_name        : (indirect string, offset: 0xc32c): xTIME_OUT
    <e2e>   DW_AT_byte_size   : 8
    <e2f>   DW_AT_decl_file   : 8
    <e30>   DW_AT_decl_line   : 102
    <e31>   DW_AT_decl_column : 16
    <e32>   DW_AT_sibling     : <0xe51>
 <2><e36>: Abbrev Number: 4 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0xc736): xOverflowCount
    <e3b>   DW_AT_decl_file   : 8
    <e3c>   DW_AT_decl_line   : 104
    <e3d>   DW_AT_decl_column : 13
    <e3e>   DW_AT_type        : <0xb77>
    <e42>   DW_AT_data_member_location: 0
 <2><e43>: Abbrev Number: 4 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0xc6a9): xTimeOnEntering
    <e48>   DW_AT_decl_file   : 8
    <e49>   DW_AT_decl_line   : 105
    <e4a>   DW_AT_decl_column : 13
    <e4b>   DW_AT_type        : <0xb9e>
    <e4f>   DW_AT_data_member_location: 4
 <2><e50>: Abbrev Number: 0
 <1><e51>: Abbrev Number: 7 (DW_TAG_typedef)
    <e52>   DW_AT_name        : (indirect string, offset: 0x2865): TimeOut_t
    <e56>   DW_AT_decl_file   : 8
    <e57>   DW_AT_decl_line   : 106
    <e58>   DW_AT_decl_column : 3
    <e59>   DW_AT_type        : <0xe29>
 <1><e5d>: Abbrev Number: 7 (DW_TAG_typedef)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x1832): QueueHandle_t
    <e62>   DW_AT_decl_file   : 9
    <e63>   DW_AT_decl_line   : 48
    <e64>   DW_AT_decl_column : 34
    <e65>   DW_AT_type        : <0xe6e>
 <1><e69>: Abbrev Number: 8 (DW_TAG_const_type)
    <e6a>   DW_AT_type        : <0xe5d>
 <1><e6e>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <e6f>   DW_AT_byte_size   : 4
    <e6f>   DW_AT_type        : <0xe73>
 <1><e73>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e74>   DW_AT_name        : (indirect string, offset: 0xc336): QueueDefinition
    <e78>   DW_AT_byte_size   : 80
    <e79>   DW_AT_decl_file   : 1
    <e7a>   DW_AT_decl_line   : 97
    <e7b>   DW_AT_decl_column : 16
    <e7c>   DW_AT_sibling     : <0xf28>
 <2><e80>: Abbrev Number: 4 (DW_TAG_member)
    <e81>   DW_AT_name        : (indirect string, offset: 0xc10c): pcHead
    <e85>   DW_AT_decl_file   : 1
    <e86>   DW_AT_decl_line   : 99
    <e87>   DW_AT_decl_column : 10
    <e88>   DW_AT_type        : <0xf50>
    <e8c>   DW_AT_data_member_location: 0
 <2><e8d>: Abbrev Number: 4 (DW_TAG_member)
    <e8e>   DW_AT_name        : (indirect string, offset: 0xbede): pcWriteTo
    <e92>   DW_AT_decl_file   : 1
    <e93>   DW_AT_decl_line   : 100
    <e94>   DW_AT_decl_column : 10
    <e95>   DW_AT_type        : <0xf50>
    <e99>   DW_AT_data_member_location: 4
 <2><e9a>: Abbrev Number: 46 (DW_TAG_member)
    <e9b>   DW_AT_name        : u
    <e9d>   DW_AT_decl_file   : 1
    <e9e>   DW_AT_decl_line   : 106
    <e9f>   DW_AT_decl_column : 4
    <ea0>   DW_AT_type        : <0xf95>
    <ea4>   DW_AT_data_member_location: 8
 <2><ea5>: Abbrev Number: 4 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0xc36c): xTasksWaitingToSend
    <eaa>   DW_AT_decl_file   : 1
    <eab>   DW_AT_decl_line   : 108
    <eac>   DW_AT_decl_column : 9
    <ead>   DW_AT_type        : <0xdfd>
    <eb1>   DW_AT_data_member_location: 16
 <2><eb2>: Abbrev Number: 4 (DW_TAG_member)
    <eb3>   DW_AT_name        : (indirect string, offset: 0xbe26): xTasksWaitingToReceive
    <eb7>   DW_AT_decl_file   : 1
    <eb8>   DW_AT_decl_line   : 109
    <eb9>   DW_AT_decl_column : 9
    <eba>   DW_AT_type        : <0xdfd>
    <ebe>   DW_AT_data_member_location: 36
 <2><ebf>: Abbrev Number: 4 (DW_TAG_member)
    <ec0>   DW_AT_name        : (indirect string, offset: 0xc31a): uxMessagesWaiting
    <ec4>   DW_AT_decl_file   : 1
    <ec5>   DW_AT_decl_line   : 111
    <ec6>   DW_AT_decl_column : 23
    <ec7>   DW_AT_type        : <0xb94>
    <ecb>   DW_AT_data_member_location: 56
 <2><ecc>: Abbrev Number: 4 (DW_TAG_member)
    <ecd>   DW_AT_name        : (indirect string, offset: 0xc0bd): uxLength
    <ed1>   DW_AT_decl_file   : 1
    <ed2>   DW_AT_decl_line   : 112
    <ed3>   DW_AT_decl_column : 14
    <ed4>   DW_AT_type        : <0xb88>
    <ed8>   DW_AT_data_member_location: 60
 <2><ed9>: Abbrev Number: 4 (DW_TAG_member)
    <eda>   DW_AT_name        : (indirect string, offset: 0xc555): uxItemSize
    <ede>   DW_AT_decl_file   : 1
    <edf>   DW_AT_decl_line   : 113
    <ee0>   DW_AT_decl_column : 14
    <ee1>   DW_AT_type        : <0xb88>
    <ee5>   DW_AT_data_member_location: 64
 <2><ee6>: Abbrev Number: 4 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0xc935): cRxLock
    <eeb>   DW_AT_decl_file   : 1
    <eec>   DW_AT_decl_line   : 115
    <eed>   DW_AT_decl_column : 18
    <eee>   DW_AT_type        : <0xb50>
    <ef2>   DW_AT_data_member_location: 68
 <2><ef3>: Abbrev Number: 4 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xd03f): cTxLock
    <ef8>   DW_AT_decl_file   : 1
    <ef9>   DW_AT_decl_line   : 116
    <efa>   DW_AT_decl_column : 18
    <efb>   DW_AT_type        : <0xb50>
    <eff>   DW_AT_data_member_location: 69
 <2><f00>: Abbrev Number: 4 (DW_TAG_member)
    <f01>   DW_AT_name        : (indirect string, offset: 0xc874): ucStaticallyAllocated
    <f05>   DW_AT_decl_file   : 1
    <f06>   DW_AT_decl_line   : 119
    <f07>   DW_AT_decl_column : 11
    <f08>   DW_AT_type        : <0xb5a>
    <f0c>   DW_AT_data_member_location: 70
 <2><f0d>: Abbrev Number: 4 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xc144): uxQueueNumber
    <f12>   DW_AT_decl_file   : 1
    <f13>   DW_AT_decl_line   : 127
    <f14>   DW_AT_decl_column : 15
    <f15>   DW_AT_type        : <0xb88>
    <f19>   DW_AT_data_member_location: 72
 <2><f1a>: Abbrev Number: 4 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0xcf67): ucQueueType
    <f1f>   DW_AT_decl_file   : 1
    <f20>   DW_AT_decl_line   : 128
    <f21>   DW_AT_decl_column : 11
    <f22>   DW_AT_type        : <0xb5a>
    <f26>   DW_AT_data_member_location: 76
 <2><f27>: Abbrev Number: 0
 <1><f28>: Abbrev Number: 15 (DW_TAG_structure_type)
    <f29>   DW_AT_name        : (indirect string, offset: 0xc7fa): QueuePointers
    <f2d>   DW_AT_byte_size   : 8
    <f2e>   DW_AT_decl_file   : 1
    <f2f>   DW_AT_decl_line   : 67
    <f30>   DW_AT_decl_column : 16
    <f31>   DW_AT_sibling     : <0xf50>
 <2><f35>: Abbrev Number: 4 (DW_TAG_member)
    <f36>   DW_AT_name        : (indirect string, offset: 0xc819): pcTail
    <f3a>   DW_AT_decl_file   : 1
    <f3b>   DW_AT_decl_line   : 69
    <f3c>   DW_AT_decl_column : 10
    <f3d>   DW_AT_type        : <0xf50>
    <f41>   DW_AT_data_member_location: 0
 <2><f42>: Abbrev Number: 4 (DW_TAG_member)
    <f43>   DW_AT_name        : (indirect string, offset: 0xca32): pcReadFrom
    <f47>   DW_AT_decl_file   : 1
    <f48>   DW_AT_decl_line   : 70
    <f49>   DW_AT_decl_column : 10
    <f4a>   DW_AT_type        : <0xf50>
    <f4e>   DW_AT_data_member_location: 4
 <2><f4f>: Abbrev Number: 0
 <1><f50>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <f51>   DW_AT_byte_size   : 4
    <f51>   DW_AT_type        : <0xb44>
 <1><f55>: Abbrev Number: 7 (DW_TAG_typedef)
    <f56>   DW_AT_name        : (indirect string, offset: 0xc686): QueuePointers_t
    <f5a>   DW_AT_decl_file   : 1
    <f5b>   DW_AT_decl_line   : 71
    <f5c>   DW_AT_decl_column : 3
    <f5d>   DW_AT_type        : <0xf28>
 <1><f61>: Abbrev Number: 15 (DW_TAG_structure_type)
    <f62>   DW_AT_name        : (indirect string, offset: 0xc820): SemaphoreData
    <f66>   DW_AT_byte_size   : 8
    <f67>   DW_AT_decl_file   : 1
    <f68>   DW_AT_decl_line   : 73
    <f69>   DW_AT_decl_column : 16
    <f6a>   DW_AT_sibling     : <0xf89>
 <2><f6e>: Abbrev Number: 4 (DW_TAG_member)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xde2c): xMutexHolder
    <f73>   DW_AT_decl_file   : 1
    <f74>   DW_AT_decl_line   : 75
    <f75>   DW_AT_decl_column : 15
    <f76>   DW_AT_type        : <0xe0e>
    <f7a>   DW_AT_data_member_location: 0
 <2><f7b>: Abbrev Number: 4 (DW_TAG_member)
    <f7c>   DW_AT_name        : (indirect string, offset: 0xbdbe): uxRecursiveCallCount
    <f80>   DW_AT_decl_file   : 1
    <f81>   DW_AT_decl_line   : 76
    <f82>   DW_AT_decl_column : 14
    <f83>   DW_AT_type        : <0xb88>
    <f87>   DW_AT_data_member_location: 4
 <2><f88>: Abbrev Number: 0
 <1><f89>: Abbrev Number: 7 (DW_TAG_typedef)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xbdae): SemaphoreData_t
    <f8e>   DW_AT_decl_file   : 1
    <f8f>   DW_AT_decl_line   : 77
    <f90>   DW_AT_decl_column : 3
    <f91>   DW_AT_type        : <0xf61>
 <1><f95>: Abbrev Number: 47 (DW_TAG_union_type)
    <f96>   DW_AT_byte_size   : 8
    <f97>   DW_AT_decl_file   : 1
    <f98>   DW_AT_decl_line   : 102
    <f99>   DW_AT_decl_column : 2
    <f9a>   DW_AT_sibling     : <0xfb3>
 <2><f9e>: Abbrev Number: 34 (DW_TAG_member)
    <f9f>   DW_AT_name        : (indirect string, offset: 0xcec6): xQueue
    <fa3>   DW_AT_decl_file   : 1
    <fa3>   DW_AT_decl_line   : 104
    <fa4>   DW_AT_decl_column : 19
    <fa4>   DW_AT_type        : <0xf55>
 <2><fa8>: Abbrev Number: 34 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xcf73): xSemaphore
    <fad>   DW_AT_decl_file   : 1
    <fad>   DW_AT_decl_line   : 105
    <fae>   DW_AT_decl_column : 19
    <fae>   DW_AT_type        : <0xf89>
 <2><fb2>: Abbrev Number: 0
 <1><fb3>: Abbrev Number: 7 (DW_TAG_typedef)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xc7f3): xQUEUE
    <fb8>   DW_AT_decl_file   : 1
    <fb9>   DW_AT_decl_line   : 131
    <fba>   DW_AT_decl_column : 3
    <fbb>   DW_AT_type        : <0xe73>
 <1><fbf>: Abbrev Number: 7 (DW_TAG_typedef)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xc625): Queue_t
    <fc4>   DW_AT_decl_file   : 1
    <fc5>   DW_AT_decl_line   : 135
    <fc6>   DW_AT_decl_column : 16
    <fc7>   DW_AT_type        : <0xfb3>
 <1><fcb>: Abbrev Number: 8 (DW_TAG_const_type)
    <fcc>   DW_AT_type        : <0xfbf>
 <1><fd0>: Abbrev Number: 15 (DW_TAG_structure_type)
    <fd1>   DW_AT_name        : (indirect string, offset: 0xca5f): QUEUE_REGISTRY_ITEM
    <fd5>   DW_AT_byte_size   : 8
    <fd6>   DW_AT_decl_file   : 1
    <fd7>   DW_AT_decl_line   : 148
    <fd8>   DW_AT_decl_column : 17
    <fd9>   DW_AT_sibling     : <0xff8>
 <2><fdd>: Abbrev Number: 4 (DW_TAG_member)
    <fde>   DW_AT_name        : (indirect string, offset: 0xc96d): pcQueueName
    <fe2>   DW_AT_decl_file   : 1
    <fe3>   DW_AT_decl_line   : 150
    <fe4>   DW_AT_decl_column : 15
    <fe5>   DW_AT_type        : <0xb34>
    <fe9>   DW_AT_data_member_location: 0
 <2><fea>: Abbrev Number: 4 (DW_TAG_member)
    <feb>   DW_AT_name        : (indirect string, offset: 0xe424): xHandle
    <fef>   DW_AT_decl_file   : 1
    <ff0>   DW_AT_decl_line   : 151
    <ff1>   DW_AT_decl_column : 17
    <ff2>   DW_AT_type        : <0xe5d>
    <ff6>   DW_AT_data_member_location: 4
 <2><ff7>: Abbrev Number: 0
 <1><ff8>: Abbrev Number: 7 (DW_TAG_typedef)
    <ff9>   DW_AT_name        : (indirect string, offset: 0xc359): xQueueRegistryItem
    <ffd>   DW_AT_decl_file   : 1
    <ffe>   DW_AT_decl_line   : 152
    <fff>   DW_AT_decl_column : 4
    <1000>   DW_AT_type        : <0xfd0>
 <1><1004>: Abbrev Number: 7 (DW_TAG_typedef)
    <1005>   DW_AT_name        : (indirect string, offset: 0xbea6): QueueRegistryItem_t
    <1009>   DW_AT_decl_file   : 1
    <100a>   DW_AT_decl_line   : 157
    <100b>   DW_AT_decl_column : 29
    <100c>   DW_AT_type        : <0xff8>
 <1><1010>: Abbrev Number: 16 (DW_TAG_array_type)
    <1011>   DW_AT_type        : <0x1004>
    <1015>   DW_AT_sibling     : <0x1020>
 <2><1019>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <101a>   DW_AT_type        : <0xab0>
    <101e>   DW_AT_upper_bound : 7
 <2><101f>: Abbrev Number: 0
 <1><1020>: Abbrev Number: 48 (DW_TAG_variable)
    <1021>   DW_AT_name        : (indirect string, offset: 0xc1c8): xQueueRegistry
    <1025>   DW_AT_decl_file   : 1
    <1026>   DW_AT_decl_line   : 162
    <1027>   DW_AT_decl_column : 38
    <1028>   DW_AT_type        : <0x1010>
    <102c>   DW_AT_external    : 1
    <102c>   DW_AT_location    : 5 byte block: 3 24 87 0 20 	(DW_OP_addr: 20008724)
 <1><1032>: Abbrev Number: 19 (DW_TAG_subprogram)
    <1033>   DW_AT_external    : 1
    <1033>   DW_AT_name        : (indirect string, offset: 0xbe06): vTaskPlaceOnEventListRestricted
    <1037>   DW_AT_decl_file   : 8
    <1038>   DW_AT_decl_line   : 2390
    <103a>   DW_AT_decl_column : 6
    <103a>   DW_AT_prototyped  : 1
    <103a>   DW_AT_declaration : 1
    <103a>   DW_AT_sibling     : <0x104e>
 <2><103e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <103f>   DW_AT_type        : <0x1053>
 <2><1043>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1044>   DW_AT_type        : <0xb9e>
 <2><1048>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1049>   DW_AT_type        : <0xb83>
 <2><104d>: Abbrev Number: 0
 <1><104e>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <104f>   DW_AT_byte_size   : 4
    <104f>   DW_AT_type        : <0xdfd>
 <1><1053>: Abbrev Number: 8 (DW_TAG_const_type)
    <1054>   DW_AT_type        : <0x104e>
 <1><1058>: Abbrev Number: 35 (DW_TAG_subprogram)
    <1059>   DW_AT_external    : 1
    <1059>   DW_AT_name        : (indirect string, offset: 0xc6f9): vTaskMissedYield
    <105d>   DW_AT_decl_file   : 8
    <105d>   DW_AT_decl_line   : 2444
    <105f>   DW_AT_decl_column : 6
    <105f>   DW_AT_prototyped  : 1
    <105f>   DW_AT_declaration : 1
 <1><105f>: Abbrev Number: 36 (DW_TAG_subprogram)
    <1060>   DW_AT_external    : 1
    <1060>   DW_AT_name        : (indirect string, offset: 0x95136): memcpy
    <1064>   DW_AT_decl_file   : 10
    <1065>   DW_AT_decl_line   : 31
    <1066>   DW_AT_decl_column : 9
    <1067>   DW_AT_prototyped  : 1
    <1067>   DW_AT_type        : <0xb21>
    <106b>   DW_AT_declaration : 1
    <106b>   DW_AT_sibling     : <0x107f>
 <2><106f>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1070>   DW_AT_type        : <0xb21>
 <2><1074>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1075>   DW_AT_type        : <0xb39>
 <2><1079>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <107a>   DW_AT_type        : <0xa9f>
 <2><107e>: Abbrev Number: 0
 <1><107f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <1080>   DW_AT_external    : 1
    <1080>   DW_AT_name        : (indirect string, offset: 0xc12c): xTaskPriorityDisinherit
    <1084>   DW_AT_decl_file   : 8
    <1084>   DW_AT_decl_line   : 2462
    <1086>   DW_AT_decl_column : 12
    <1086>   DW_AT_prototyped  : 1
    <1086>   DW_AT_type        : <0xb77>
    <108a>   DW_AT_declaration : 1
    <108a>   DW_AT_sibling     : <0x1094>
 <2><108e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <108f>   DW_AT_type        : <0xe1a>
 <2><1093>: Abbrev Number: 0
 <1><1094>: Abbrev Number: 49 (DW_TAG_subprogram)
    <1095>   DW_AT_external    : 1
    <1095>   DW_AT_name        : (indirect string, offset: 0xab85): vPortFree
    <1099>   DW_AT_decl_file   : 11
    <109a>   DW_AT_decl_line   : 164
    <109b>   DW_AT_decl_column : 6
    <109c>   DW_AT_prototyped  : 1
    <109c>   DW_AT_declaration : 1
    <109c>   DW_AT_sibling     : <0x10a6>
